cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
<?xml version="1.0" encoding="UTF-8" standalone="no"?>

<!-- ********************************************************************** -->
<!-- ******  ADuCM410.svd                                                   -->
<!-- ********************************************************************** -->
<!--                                                                        -->
<!-- Date         :   Feb 26, 2020                                          -->
<!--                                                                        -->
<!-- ARM CMSIS-SVD (System View Description) Schema Version 1.1             -->
<!-- Provides for device-specific debugging views of peripherals            -->
<!--                                                                        -->
<!-- Copyright (c) 2020 Analog Devices, Inc.  All Rights Reserved.          -->
<!-- This software is proprietary and confidential to Analog Devices, Inc.  -->
<!-- and its licensors.                                                     -->
<!--                                                                        -->
<!-- This file was auto-generated. Do not make local changes to this file!! -->
<!--                                                                        -->
<!-- ********************************************************************** -->

<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd" >
  <vendor>Analog Devices</vendor>                                       <!-- device vendor name -->
  <vendorID>ADI</vendorID>                                        <!-- device vendor short name -->
  <name>ADuCM410</name>                                          <!-- name of part-->
  <series>ADuCM410</series>                                         <!-- device series the device belongs to -->
  <version>1p0</version>                                          <!-- version of this description, adding CMSIS-SVD 1.1 tags -->
  <description>ARM Cortex-CM33 Microcontroller based device</description>
  <licenseText>                                                   <!-- this license text will appear in header file. 
 force line breaks -->
    ARM Limited (ARM) is supplying this software for use with Cortex-M

    processor based microcontroller, but can be equally used for other

    suitable  processor architectures. This file can be freely distributed.

    Modifications to this file shall be clearly marked.

    

    THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED

    OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF

    MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.

    ARM SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR

    CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
  </licenseText>
  <cpu>                                                           <!-- details about the cpu embedded in the device -->
    <name>CM33</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <mpuPresent>true</mpuPresent>
    <fpuPresent>true</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <headerSystemFilename>system_ADuCM410</headerSystemFilename>
  <headerDefinitionsPrefix>ADI_</headerDefinitionsPrefix>
  <addressUnitBits>8</addressUnitBits>                            <!-- byte addressable memory -->
  <width>32</width>                                               <!-- bus width is 32 bits -->
  <!-- default settings implicitly inherited by subsequent sections -->
  <!-- the size of the registers is set to a bit width of 32. This can be overruled for individual peripherals and/or registers -->
  <size>32</size>                                                 <!-- this is the default size (number of bits) of all peripherals
                                                                       and register that do not define "size" themselves -->
  <!-- the access to all registers is set to be readable and writeable. This can be overruled for individual peripherals and/or registers -->
  <access>read-write</access>                                     <!-- default access permission for all subsequent registers -->
  <!-- for demonstration purposes the resetValue for all registers of the device is set to be 0. This can be overruled within the description -->
  <resetValue>0x00000000</resetValue>                             <!-- by default all bits of the registers are initialized to 0 on reset -->
  <!-- the resetMask = 0 specifies that by default no register of this device has a defined reset value -->
  <resetMask>0xFFFFFFFF</resetMask>                               <!-- by default all 32Bits of the registers are used -->
     <peripherals>
      <peripheral>
         <name>GPT0</name>
         <description>Unknown</description>
         <baseAddress>0x40000000</baseAddress>
         <groupName>GPT0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000040</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>GPT0</name>
	    <value>12</value>
	    <description>GPT0</description>
	 </interrupt>
         <registers>
            <register>
               <name>LD</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size> 
               <description>16-bit Load Value Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LOAD</name>
                     <description>Load Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>VAL</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size> 
               <description>16-bit Timer Value Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COUNT_VAL</name>
                     <description>Current Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CON</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size> 
               <description>Control Register</description>
               <resetValue>0x0000000A</resetValue>
               <fields>
                  <field>
                     <name>PRE</name>
                     <description>Prescaler</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIV1OR4</name>
                           <description>Source_clock / [1 or 4]</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16</name>
                           <description>Source_clock / 16</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV256</name>
                           <description>Source_clock / 256</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV32768</name>
                           <description>Source_clock / 32,768</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UP</name>
                     <description>Count up</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>DIS. Timer is Set to Count Down (default)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>EN. Timer is Set to Count up</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MOD</name>
                     <description>Timer Mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FREERUN</name>
                           <description>FREERUN.Timer Runs in Free Running Mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERIODIC</name>
                           <description>PERIODIC. Timer Runs in Periodic Mode (default)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Timer Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>DIS. Timer is Disabled (default)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>EN. Timer is Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLK</name>
                     <description>Clock Select</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PCLK0</name>
                           <description>PCLK.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HCLK</name>
                           <description>ROOT_CLK</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LFOSC</name>
                           <description>LFOSC. 32 KHz OSC</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HFXTAL</name>
                           <description>HFXTAL. 16 MHz OSC or XTAL (Dependent on CLKCON0.11)</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RLD</name>
                     <description>Reload Control</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Up/Down Counter is Only Reset on a Timeout Event</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>Resets the Up/down Counter When GPTCLRI[0] is Set</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLRI</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size> 
               <description>Clear Interrupt Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TMOUT</name>
                     <description>Clear Timeout Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>STA</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>32</size> 
               <description>Status Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TMOUT</name>
                     <description>Timeout Event Occurred</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CLR_FLAG</name>
                           <description>No Timeout Event Has Occurred</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SET_FLAG</name>
                           <description>a Timeout Event Has Occurred</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>Timer Busy</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CLR_FLAG</name>
                           <description>Timer Ready to Receive Commands to GPTCON</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SET_FLAG</name>
                           <description>Timer Not Ready to Receive Commands to GPTCON</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PDOK</name>
                     <description>GPTCLRI Synchronization</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CLR_FLAG</name>
                           <description>CLR. the Interrupt is Cleared in the Timer Clock Domain</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SET_FLAG</name>
                           <description>SET. GPTCLRI[0] is Being Updated in the Timer Clock Domain</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
