cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="GPT0">
         <name>GPT1</name>
         <baseAddress>0x40000400</baseAddress>
	 <interrupt>
	    <name>GPT1</name>
	    <value>13</value>
	    <description>GPT1</description>
	 </interrupt>
      </peripheral>
      <peripheral derivedFrom="GPT0">
         <name>GPT2</name>
         <baseAddress>0x40000800</baseAddress>
	 <interrupt>
	    <name>GPT2</name>
	    <value>14</value>
	    <description>GPT2</description>
	 </interrupt>
      </peripheral>
      <peripheral>
         <name>GPTH0</name>
         <description>Unknown</description>
         <baseAddress>0x40000C00</baseAddress>
         <groupName>GPTH0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>GPT3</name>
	    <value>15</value>
	    <description>GPT3</description>
	 </interrupt>
         <registers>
            <register>
               <name>CTL</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>Timer Control</description>
               <resetValue>0x00000170</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>Timer Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SEL</name>
                     <description>Clock Source Select</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PCLK</name>
                           <description>PCLK</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYSCLK</name>
                           <description>HCLK</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LFOSC</name>
                           <description>High Frequency Oscillator</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HFXSTAL</name>
                           <description>High Frequency XTALL</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PRE</name>
                     <description>Timer Prescale</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000001F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNT</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <description>Count Value</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNT</name>
                     <description>Current Counter Value.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <description>Timer Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>cc0_status</name>
                     <description>CC0 Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>cc1_status</name>
                     <description>CC1 Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>cc2_status</name>
                     <description>CC2 Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>cc3_status</name>
                     <description>CC3 Status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>CFG[%s]</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size>
               <description>Capture Compare Configuration</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MODE</name>
                     <description>Capture or Compare Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CMP</name>
                           <description>Compare</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CAP</name>
                           <description>Capture</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CC_EN</name>
                     <description>Capture Compare Enabled</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>EVENT_SEL</name>
                     <description>Capture Events Select</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>CC[%s]</name>
               <addressOffset>0x00000020</addressOffset>
               <size>32</size>
               <description>Compare and Capture Value</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CC</name>
                     <description>Capture or Compare Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
