cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="GPTH0">
         <name>GPTH1</name>
         <baseAddress>0x40001000</baseAddress>
	 <interrupt>
	    <name>GPT4</name>
	    <value>16</value>
	    <description>GPT4</description>
	 </interrupt>
      </peripheral>
      <peripheral>
         <name>MISC16</name>
         <description>Unknown</description>
         <baseAddress>0x40002000</baseAddress>
         <groupName>MISC16</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00001000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>ADIID</name>
               <addressOffset>0x00000020</addressOffset>
               <size>32</size>
               <description>ADI ID</description>
               <resetValue>0x00004144</resetValue>
               <fields>
                  <field>
                     <name>ADIID</name>
                     <description>ADI ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHIPID</name>
               <addressOffset>0x00000024</addressOffset>
               <size>32</size>
               <description>Chip ID</description>
               <resetValue>0x00000571</resetValue>
               <fields>
                  <field>
                     <name>REVISION</name>
                     <description>Silicon Revision Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PARTID</name>
                     <description>Part Identifier</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>USERKEY</name>
               <addressOffset>0x00000134</addressOffset>
               <size>32</size>
               <description>Open to Customer to Protect Important Registers</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>User Key</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>WUT</name>
         <description>Unknown</description>
         <baseAddress>0x40003000</baseAddress>
         <groupName>WUT</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000080</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>WUT</name>
	    <value>0</value>
	    <description>WUT</description>
	 </interrupt>
         <registers>
            <register>
               <name>T4VAL0</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size> 
               <description>Current Count Value - LS 16 Bits</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>T4VALL</name>
                     <description>Current Count Low</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>T4VAL1</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size> 
               <description>Current Count Value - MS 16 Bits</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>T4VALH</name>
                     <description>Current Count High</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>T4CON</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size> 
               <description>Control Register</description>
               <resetValue>0x00000040</resetValue>
               <fields>
                  <field>
                     <name>PRE</name>
                     <description>Prescaler</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PREDIV1</name>
                           <description>PREDIV1: Source Clock/1 (default). If the Selected Clock Source is PCLK, Then This Setting Results in a Prescaler of 4.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PREDIV16</name>
                           <description>PREDIV16: Source Clock/16</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PREDIV256</name>
                           <description>PREDIV256: Source Clock/256</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PREDIV32768</name>
                           <description>PREDIV32768: Source Clock/32,768</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FREEZE</name>
                     <description>Freeze Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>DIS: Cleared by User to Disable This Feature (default).</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>EN: Set by User to Enable the Freeze of the High 16-bits After the Lower Bits Have Been Read from T4VAL0. This Ensures That the Software Will Read an Atomic Shot of the Timer. T4VAL1 Unfreezes After It Has Been Read.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TMODE</name>
                     <description>Timer Mode</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PERIODIC</name>
                           <description>PERIODIC: Cleared by User to Operate in Periodic Mode. in This Mode, the Timer Counts up to T4WUFD</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREERUN</name>
                           <description>FREERUN: Set by User to Operate in Free Running Mode (default).</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Timer Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>DIS: Disable the Timer (default).</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>EN: Enable the Timer.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WUEN</name>
                     <description>Wakeup Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>DIS: Cleared by User to Disable the Wake up Timer When the Core Clock is off</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>EN: Set by User to Enable the Wake up Timer Even When the Core Clock is Off.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLK</name>
                     <description>Clock Select</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PCLK</name>
                           <description>PCLK: PCLK (default)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LFOSC</name>
                           <description>LFOSC: 32 KHz Internal Oscillator</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LFOSC1</name>
                           <description>LFOSC: 32kHz Internal Oscillator</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ECLKIN</name>
                           <description>ECLKIN: External Clock from P1.0</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>STOP_WUFA</name>
                     <description>Disables Updating Field a Register T4WUFA</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>T4INC</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size> 
               <description>12-bit Interval for Wakeup Field a</description>
               <resetValue>0x000000C8</resetValue>
               <fields>
                  <field>
                     <name>INTERVAL</name>
                     <description>Interval for Wakeup Field a</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>T4WUFB0</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size> 
               <description>Wakeup Field B - LS 16 Bits</description>
               <resetValue>0x00001FFF</resetValue>
               <fields>
                  <field>
                     <name>T4WUFBL</name>
                     <description>Wakeup Field B Low</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>T4WUFB1</name>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size> 
               <description>Wakeup Field B - MS 16 Bits</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>T4WUFBH</name>
                     <description>Wakeup Field B High</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>T4WUFC0</name>
               <addressOffset>0x00000018</addressOffset>
               <size>32</size> 
               <description>Wakeup Field C - LS 16 Bits</description>
               <resetValue>0x00002FFF</resetValue>
               <fields>
                  <field>
                     <name>T4WUFCL</name>
                     <description>Wakeup Field C Low</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>T4WUFC1</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>32</size> 
               <description>Wakeup Field C - MS 16 Bits</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>T4WUFCH</name>
                     <description>Wakeup Field C High</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>T4WUFD0</name>
               <addressOffset>0x00000020</addressOffset>
               <size>32</size> 
               <description>Wakeup Field D - LS 16 Bits</description>
               <resetValue>0x00003FFF</resetValue>
               <fields>
                  <field>
                     <name>T4WUFD0</name>
                     <description>Wakeup Field D Low</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>T4WUFD1</name>
               <addressOffset>0x00000024</addressOffset>
               <size>32</size> 
               <description>Wakeup Field D - MS 16 Bits</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>T4WUFDH</name>
                     <description>Wakeup Field D High</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>T4IEN</name>
               <addressOffset>0x00000028</addressOffset>
               <size>32</size> 
               <description>Interrupt Enable Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WUFA</name>
                     <description>T4WUFA Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>WUFB</name>
                     <description>T4WUFB Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>WUFC</name>
                     <description>T4WUFC Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>WUFD</name>
                     <description>T4WUFD Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>ROLL</name>
                     <description>Rollover Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
