cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
            <register>
               <name>T4STA</name>
               <addressOffset>0x0000002C</addressOffset>
               <size>32</size> 
               <description>Status Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WUFA</name>
                     <description>T4WUFA Interrupt Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WUFB</name>
                     <description>T4WUFB Interrupt Flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WUFC</name>
                     <description>T4WUFC Interrupt Flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WUFD</name>
                     <description>T4WUFD Interrupt Flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ROLL</name>
                     <description>Rollover Interrupt Flag</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>IRQCRY</name>
                     <description>Wakeup Status to Powerdown</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>FREEZE</name>
                     <description>Timer Value Freeze</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PDOK</name>
                     <description>Enable Bit Synchronized</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>T4CLRI</name>
               <addressOffset>0x00000030</addressOffset>
               <size>32</size> 
               <description>Clear Interrupt Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WUFA</name>
                     <description>T4WUFA Interrupt Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>WUFB</name>
                     <description>T4WUFB Interrupt Clear</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>WUFC</name>
                     <description>T4WUFC Interrupt Clear</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>WUFD</name>
                     <description>T4WUFD Interrupt Clear</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>ROLL</name>
                     <description>Rollover Interrupt Clear</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>T4WUFA0</name>
               <addressOffset>0x0000003C</addressOffset>
               <size>32</size> 
               <description>Wakeup Field a - LS 16 Bits</description>
               <resetValue>0x00001900</resetValue>
               <fields>
                  <field>
                     <name>T4WUFAL</name>
                     <description>Wakeup Field a Low</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>T4WUFA1</name>
               <addressOffset>0x00000040</addressOffset>
               <size>32</size> 
               <description>Wakeup Field a - MS 16 Bits</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>T4WUFAH</name>
                     <description>Wakeup Field a High</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
