cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>WDT</name>
         <description>Unknown</description>
         <baseAddress>0x40004000</baseAddress>
         <groupName>WDT</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>WDT</name>
	    <value>11</value>
	    <description>WDT</description>
	 </interrupt>
         <registers>
            <register>
               <name>LD</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size> 
               <description>Watchdog Timer Load Value</description>
               <resetValue>0x00001000</resetValue>
               <fields>
                  <field>
                     <name>LOAD</name>
                     <description>WDT Load Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>VALS</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size> 
               <description>Current Count Value</description>
               <resetValue>0x00001000</resetValue>
               <fields>
                  <field>
                     <name>CCOUNT</name>
                     <description>Current WDT Count Value.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CON</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size> 
               <description>Watchdog Timer Control Register</description>
               <resetValue>0x00000069</resetValue>
               <fields>
                  <field>
                     <name>PDSTOP</name>
                     <description>Power Down Stop Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CONTINUE</name>
                           <description>Continue Counting When in Hibernate</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STOPED</name>
                           <description>Stop Counter When in Hibernate.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IRQ</name>
                     <description>WDT Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RESET</name>
                           <description>Watchdog Timer Timeout Creates a Reset.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INTERRUPT</name>
                           <description>Watchdog Timer Timeout Creates an Interrupt Instead of Reset.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PRE</name>
                     <description>Prescaler.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIV1</name>
                           <description>Source Clock/1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16</name>
                           <description>Source Clock/16.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV256</name>
                           <description>Source Clock/256 (default).</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV4096</name>
                           <description>Source Clock/4096</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Timer Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MDE</name>
                     <description>Timer Mode Select</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FREE</name>
                           <description>Free-running Mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERIODIC</name>
                           <description>Periodic Mode (default)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLKDIV2</name>
                     <description>Clock Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MINLOADEN</name>
                     <description>Timer Window Control</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>WDTIRQEN</name>
                     <description>WDT Interrupt Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLRI</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size> 
               <description>Refresh Watchdog Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLRWDG</name>
                     <description>Refresh Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>STA</name>
               <addressOffset>0x00000018</addressOffset>
               <size>32</size> 
               <description>Timer Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IRQ</name>
                     <description>WDT Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CLEARED</name>
                           <description>Watchdog Timer Interrupt Not Pending</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PENDING</name>
                           <description>Watchdog Timer Interrupt Pending</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLRI</name>
                     <description>WDTCLRI Write Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TLD</name>
                     <description>WDTVAL Write Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CON</name>
                     <description>WDTCON Write Status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LOCKS</name>
                     <description>Lock Status</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>OPENED</name>
                           <description>Timer Operation Not Locked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>Timer Enabled and Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OTPWRDONE</name>
                     <description>Reset Type Status</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TMINLD</name>
                     <description>WDTMINLD Write Status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>MINLD</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>32</size> 
               <description>Minimum Load Value</description>
               <resetValue>0x00000800</resetValue>
               <fields>
                  <field>
                     <name>MINLOAD</name>
                     <description>WDT Min Load Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
