cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>ALLON</name>
         <description>Unknown</description>
         <baseAddress>0x40005000</baseAddress>
         <groupName>ALLON</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000080</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>PWRMOD</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size> 
               <description>Power Modes</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWRMOD</name>
                     <description>Power Modes Control Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FULLACTIVE</name>
                           <description>Active Mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CORESLEEP</name>
                           <description>CORE_SLEEP Mode</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYSSLEEP</name>
                           <description>SYS_SLEEP Mode</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIBERNATE</name>
                           <description>Hibernate Mode</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WICENACK</name>
                     <description>WIC Acknowledgment for SLEEPDEEP</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOACK</name>
                           <description>Unknown</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACK</name>
                           <description>Unknown</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWRKEY</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size> 
               <description>Key Protection for PWRMOD</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWRKEY</name>
                     <description>Power Control Key Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>RSTCFG</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size> 
               <description>Reset Configuration</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>GPIO_PLA_RETAIN</name>
                     <description>GPIO/PLA Retain Their Status After WDT and Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>GPIO/PLA  Retain Status After Watchdog or Software Reset.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>GPIO/PLA not Retain Status After Watchdog or Software Reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LV_RETAIN</name>
                     <description>LV Die Retain Status After Watchdog or Software Reset</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>LV Die Retain Status After Watchdog or Software Reset.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>LV Die not Retain Status After Watchdog or Software Reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ANA_RETAIN</name>
                     <description>Analog Block Retain Status After Watchdog or Software Reset</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>GPIO/PLA Retain Status After Watchdog or Software Reset.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>GPIO/PLA not Retain Status After Watchdog or Software Reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RSTKEY</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size> 
               <description>Key Protection for RSTCFG</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RSTKEY</name>
                     <description>Reset Configuration Key Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>EI0CFG</name>
               <addressOffset>0x00000020</addressOffset>
               <size>32</size> 
               <description>External Interrupt Configuration 0</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IRQ0MDE</name>
                     <description>External Interrupt 0 Mode Registers</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising Edge</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling Edge</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISEORFALL</name>
                           <description>Rising or Falling Edge</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGHLEVEL</name>
                           <description>High Level</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOWLEVEL</name>
                           <description>Low Level</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALLAUX</name>
                           <description>Falling Edge (same as 001)</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISEORFALLAUX</name>
                           <description>Rising or Falling Edge (same as 010)</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGHLEVELAUX</name>
                           <description>High Level (same as 011)</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IRQ0EN</name>
                     <description>External Interrupt 0 Enable Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>External Interrupt 0 Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>External Interrupt 0 Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IRQ1MDE</name>
                     <description>External Interrupt 1 Mode Registers</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising Edge</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling Edge</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISEORFALL</name>
                           <description>Rising or Falling Edge</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGHLEVEL</name>
                           <description>High Level</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOWLEVEL</name>
                           <description>Low Level</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALLAUX</name>
                           <description>Falling Edge (same as 001)</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISEORFALLAUX</name>
                           <description>Rising or Falling Edge (same as 010)</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGHLEVELAUX</name>
                           <description>High Level (same as 011)</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IRQ1EN</name>
                     <description>External Interrupt 1 Enable Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>External Interrupt 0 Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>External Interrupt 0 Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IRQ2MDE</name>
                     <description>External Interrupt 2 Mode Registers</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising Edge</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling Edge</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISEORFALL</name>
                           <description>Rising or Falling Edge</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGHLEVEL</name>
                           <description>High Level</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOWLEVEL</name>
                           <description>Low Level</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALLAUX</name>
                           <description>Falling Edge (same as 001)</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISEORFALLAUX</name>
                           <description>Rising or Falling Edge (same as 010)</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGHLEVELAUX</name>
                           <description>High Level (same as 011)</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IRQ2EN</name>
                     <description>External Interrupt 2 Enable Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>External Interrupt 2 Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>External Interrupt 2 Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IRQ3MDE</name>
                     <description>External Interrupt 3 Mode Registers</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising Edge</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling Edge</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISEORFALL</name>
                           <description>Rising or Falling Edge</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGHLEVEL</name>
                           <description>High Level</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOWLEVEL</name>
                           <description>Low Level</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALLAUX</name>
                           <description>Falling Edge (same as 001)</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISEORFALLAUX</name>
                           <description>Rising or Falling Edge (same as 010)</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGHLEVELAUX</name>
                           <description>High Level (same as 011)</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IRQ3EN</name>
                     <description>External Interrupt 3 Enable Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>External Interrupt 3 Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>External Interrupt 3 Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
