cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
            <register>
               <name>EI1CFG</name>
               <addressOffset>0x00000024</addressOffset>
               <size>32</size> 
               <description>External Interrupt Configuration 1</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IRQ4MDE</name>
                     <description>External Interrupt 4 Mode Registers</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising Edge</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling Edge</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISEORFALL</name>
                           <description>Rising or Falling Edge</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGHLEVEL</name>
                           <description>High Level</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOWLEVEL</name>
                           <description>Low Level</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALLAUX</name>
                           <description>Falling Edge (same as 001)</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISEORFALLAUX</name>
                           <description>Rising or Falling Edge (same as 010)</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGHLEVELAUX</name>
                           <description>High Level (same as 011)</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IRQ4EN</name>
                     <description>External Interrupt 4 Enable Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>External Interrupt 4 Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>External Interrupt 4 Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IRQ5MDE</name>
                     <description>External Interrupt 5 Mode Registers</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RISING</name>
                           <description>Rising Edge</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALLING</name>
                           <description>Falling Edge</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISEORFALL</name>
                           <description>Rising or Falling Edge</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGHLEVEL</name>
                           <description>High Level</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOWLEVEL</name>
                           <description>Low Level</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALLAUX</name>
                           <description>Falling Edge (same as 001)</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISEORFALLAUX</name>
                           <description>Rising or Falling Edge (same as 010)</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGHLEVELAUX</name>
                           <description>High Level (same as 011)</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IRQ5EN</name>
                     <description>External Interrupt 5 Enable Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>External Interrupt 5 Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>External Interrupt 5 Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IRQ6MDE</name>
                     <description>External Interrupt 6 Mode Registers</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising Edge</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling Edge</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISEORFALL</name>
                           <description>Rising or Falling Edge</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGHLEVEL</name>
                           <description>High Level</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOWLEVEL</name>
                           <description>Low Level</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALLAUX</name>
                           <description>Falling Edge (same as 001)</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISEORFALLAUX</name>
                           <description>Rising or Falling Edge (same as 010)</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGHLEVELAUX</name>
                           <description>High Level (same as 011)</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IRQ6EN</name>
                     <description>External Interrupt 6 Enable Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>External Interrupt 6 Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>External Interrupt 6 Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IRQ7MDE</name>
                     <description>External Interrupt 7 Mode Registers</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising Edge</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling Edge</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISEORFALL</name>
                           <description>Rising or Falling Edge</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGHLEVEL</name>
                           <description>High Level</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOWLEVEL</name>
                           <description>Low Level</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALLAUX</name>
                           <description>Falling Edge (same as 001)</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISEORFALLAUX</name>
                           <description>Rising or Falling Edge (same as 010)</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGHLEVELAUX</name>
                           <description>High Level (same as 011)</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IRQ7EN</name>
                     <description>External Interrupt 7 Enable Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>External Interrupt 7 Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>External Interrupt 7 Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>EI2CFG</name>
               <addressOffset>0x00000028</addressOffset>
               <size>32</size> 
               <description>External Interrupt Configuration 2</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IRQ8MDE</name>
                     <description>External Interrupt 8 Mode Registers</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising Edge</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling Edge</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISEORFALL</name>
                           <description>Rising or Falling Edge</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGHLEVEL</name>
                           <description>High Level</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOWLEVEL</name>
                           <description>Low Level</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALLAUX</name>
                           <description>Falling Edge (same as 001)</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISEORFALLAUX</name>
                           <description>Rising or Falling Edge (same as 010)</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGHLEVELAUX</name>
                           <description>High Level (same as 011)</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IRQ8EN</name>
                     <description>External Interrupt 8 Enable Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>External Interrupt 8 Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>External Interrupt 8 Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IRQ9MDE</name>
                     <description>External Interrupt 8 Mode Registers</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising Edge</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling Edge</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISEORFALL</name>
                           <description>Rising or Falling Edge</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGHLEVEL</name>
                           <description>High Level</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOWLEVEL</name>
                           <description>Low Level</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALLAUX</name>
                           <description>Falling Edge (same as 001)</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISEORFALLAUX</name>
                           <description>Rising or Falling Edge (same as 010)</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGHLEVELAUX</name>
                           <description>High Level (same as 011)</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IRQ9EN</name>
                     <description>External Interrupt 8 Enable Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>External Interrupt 8 Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>External Interrupt 8 Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
