cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>PLA</name>
         <description>Unknown</description>
         <baseAddress>0x40006000</baseAddress>
         <groupName>PLA</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>PLA0</name>
	    <value>30</value>
	    <description>PLA0</description>
	 </interrupt>
	 <interrupt>
	    <name>PLA1</name>
	    <value>31</value>
	    <description>PLA1</description>
	 </interrupt>
	 <interrupt>
	    <name>PLA2</name>
	    <value>32</value>
	    <description>PLA2</description>
	 </interrupt>
	 <interrupt>
	    <name>PLA3</name>
	    <value>33</value>
	    <description>PLA3</description>
	 </interrupt>
         <registers>
        <cluster>
            <!-- dimElementGroup -->
            <dim>32</dim>
            <dimIncrement>4</dimIncrement>
            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
            <!-- end of dimElementGroup -->
            <name>ELMxcon[%s]</name>
            <description>ELMx Configuration Registers</description>
            <addressOffset>0</addressOffset>
            <register>
               <name>PLA_ELEM</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size> 
               <description>ELEMx Configuration Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MUX4</name>
                     <description>Select or Bypass Flip-flop Output</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FF</name>
                           <description>FF Output</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BYPASS</name>
                           <description>Bypass Output</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TBL</name>
                     <description>Configures Output</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>0.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FUN_NOR</name>
                           <description>NOR.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANDNOTA</name>
                           <description>B and Not A.</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOTA</name>
                           <description>NOT A.</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AANDNOTB</name>
                           <description>A and Not B.</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOTB</name>
                           <description>Not B.</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EXOR</name>
                           <description>EXOR.</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FUN_NAND</name>
                           <description>NAND.</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FUN_AND</name>
                           <description>AND.</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EXNOR</name>
                           <description>EXNOR.</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>B</name>
                           <description>B.</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BORNOTA</name>
                           <description>B or Not A.</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>A</name>
                           <description>A.</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AORNOTB</name>
                           <description>A or Not B.</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FUN_OR</name>
                           <description>OR</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>1.</description>
                           <value>15</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MUX3</name>
                     <description>Mux Between GPIO Bus Input or Odd Feedback Input</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ODD</name>
                           <description>Odd Feedback Mux</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO Input</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MUX2</name>
                     <description>Mux Between PLA_DINx Register/Block0 Output or Even Feedback</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>MMR</name>
                           <description>PLA_DINx Input</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVEN</name>
                           <description>Even Feedback Mux</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MUX1</name>
                     <description>Mux for Odd Element Feedback (In Respective Block)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ELEM1</name>
                           <description>Feedback from Element 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ELEM3</name>
                           <description>Feedback from Element 3</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ELEM5</name>
                           <description>Feedback from Element 5</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ELEM7</name>
                           <description>Feedback from Element 7</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ELEM9</name>
                           <description>Feedback from Element 9</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ELEM11</name>
                           <description>Feedback from Element 11</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ELEM13</name>
                           <description>Feedback from Element 13</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ELEM15</name>
                           <description>Feedback from Element 15</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MUX0</name>
                     <description>Mux for Even Element Feedback(in Respective Block)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ELEM0</name>
                           <description>Feedback from Element 0 (all Except Element 0) / Input from Other Block (Element 0 Only)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ELEM2</name>
                           <description>Feedback from Element 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ELEM4</name>
                           <description>Feedback from Element 4</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ELEM6</name>
                           <description>Feedback from Element 6</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ELEM8</name>
                           <description>Feedback from Element 8</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ELEM10</name>
                           <description>Feedback from Element 10</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ELEM12</name>
                           <description>Feedback from Element 12</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ELEM14</name>
                           <description>Feedback from Element 14</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
        </cluster>
            <register>
               <name>PLA_CLK</name>
               <addressOffset>0x00000080</addressOffset>
               <size>32</size> 
               <description>PLA Clock Select</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BLOCK0</name>
                     <description>Clock Select for Block 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PLACLK0</name>
                           <description>GPIO Clock 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLACLK1</name>
                           <description>GPIO Clock 1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLACLK2</name>
                           <description>GPIO Clock 2</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PCLK0</name>
                           <description>PCLK0</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MOSC</name>
                           <description>MOSC (16 MHz)</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>T0</name>
                           <description>Timer 0</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>T2</name>
                           <description>Timer 2</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>KOSC</name>
                           <description>KOSC (32 KHz)</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BLOCK1</name>
                     <description>Clock Select for Block 1</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PLACLK0</name>
                           <description>GPIO Clock 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLACLK1</name>
                           <description>GPIO Clock 1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLACLK2</name>
                           <description>GPIO Clock 2</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PCLK0</name>
                           <description>PCLK0</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MOSC</name>
                           <description>MOSC (16 MHz)</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>T0</name>
                           <description>Timer 0</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>T2</name>
                           <description>Timer 2</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>KOSC</name>
                           <description>KOSC (32 KHz)</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PLA_IRQ0</name>
               <addressOffset>0x00000084</addressOffset>
               <size>32</size> 
               <description>Interrupt Register for Block 0</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>irq0_src</name>
                     <description>IRQ0 Source Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>irq0_en</name>
                     <description>IRQ0 Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable IRQ0 Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>Enable IRQ0 Interrupt</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>irq1_src</name>
                     <description>IRQ1 Source Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>irq1_en</name>
                     <description>IRQ1 Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable IRQ1 Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>Enable IRQ1 Interrupt</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
