cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
            <register>
               <name>PLA_IRQTYPE</name>
               <addressOffset>0x000000A4</addressOffset>
               <size>32</size> 
               <description>PLA Interrupt Request and DMA Request Type</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>irq0_type</name>
                     <description>IRQ0 and DMA Request 0 Type</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>high_level</name>
                           <description>High Level Trigger Interrupt and High Level Trigger DMA Request</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>rising_edge</name>
                           <description>Rising Edge Trigger Interrupt and Rising Edge Trigger DMA Request</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>low_level</name>
                           <description>Low Level Trigger Interrupt and Low Level Trigger DMA Request</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>falling_edge</name>
                           <description>Falling Edge Trigger Interrupt and Falling Edge Trigger DMA Request</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>irq1_type</name>
                     <description>IRQ1 and DMA Request 1Type</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>high_level</name>
                           <description>High Level Trigger Interrupt and High Level Trigger DMA Request</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>rising_edge</name>
                           <description>Rising Edge Trigger Interrupt and High Level Trigger DMA Request</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>low_level</name>
                           <description>Low Level Trigger Interrupt and Low Level Trigger DMA Request</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>falling_edge</name>
                           <description>Falling Edge Trigger Interrupt and Low Level Trigger DMA Request</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>irq2_type</name>
                     <description>IRQ2 and DMA Request 2 Type</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>high_level</name>
                           <description>High Level Trigger Interrupt and High Level Trigger DMA Request</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>rising_edge</name>
                           <description>Rising Edge Trigger Interrupt and High Level Trigger DMA Request</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>low_level</name>
                           <description>Low Level Trigger Interrupt and Low Level Trigger DMA Request</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>falling_edge</name>
                           <description>Falling Edge Trigger Interrupt and Low Level Trigger DMA Request</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>irq3_type</name>
                     <description>IRQ3 and DMA Request 3 Type</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>high_level</name>
                           <description>High Level Trigger Interrupt and High Level Trigger DMA Request</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>rising_edge</name>
                           <description>Rising Edge Trigger Interrupt and High Level Trigger DMA Request</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>low_level</name>
                           <description>Low Level Trigger Interrupt and Low Level Trigger DMA Request</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>falling_edge</name>
                           <description>Falling Edge Trigger Interrupt and Low Level Trigger DMA Request</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
