cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>DMAREQ</name>
         <description>Unknown</description>
         <baseAddress>0x40007000</baseAddress>
         <groupName>DMAREQ</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>REQEN</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size> 
               <description>GPT/GPT32 and PLA DMA Request Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>GPLA_DMA_EN0</name>
                     <description>GPT/GPT32 and PLA DMA Request 0 Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>GPLA_DMA_EN1</name>
                     <description>GPT/GPT32 and PLA DMA Request 1 Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>REQ0SEL</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size> 
               <description>GPT/GPT32 and PLA DMA Request 0 Select</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DMA_REQ0_SEL</name>
                     <description>GPT/GPT32 and PLA DMA Request 0 Source Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PLA_REQ0</name>
                           <description>PLA DMA Request 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLA_REQ1</name>
                           <description>PLA DMA Request 1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLA_REQ2</name>
                           <description>PLA DMA Request 2</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLA_REQ3</name>
                           <description>PLA DMA Request 3</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GPT_REQ0</name>
                           <description>GPT 0 DMA Request</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GPT_REQ1</name>
                           <description>GPT 1 DMA Request</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GPT_REQ2</name>
                           <description>GPT 2 DMA Request</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GPt32_REQ0</name>
                           <description>GPT32 0 DMA Request</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GPT32_REQ1</name>
                           <description>GPT32 1 DMA Request</description>
                           <value>8</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>REQ1SEL</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size> 
               <description>GPT/GPT32 and PLA DMA Request 1 Select</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DMA_REQ1_SEL</name>
                     <description>GPT/GPT32 and PLA DMA Request 1 Source Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PLA_REQ0</name>
                           <description>PLA DMA Request 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLA_REQ1</name>
                           <description>PLA DMA Request 1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLA_REQ2</name>
                           <description>PLA DMA Request 2</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLA_REQ3</name>
                           <description>PLA DMA Request 3</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GPT_REQ0</name>
                           <description>GPT 0 DMA Request</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GPT_REQ1</name>
                           <description>GPT 1 DMA Request</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GPT_REQ2</name>
                           <description>GPT 2 DMA Request</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GPt32_REQ0</name>
                           <description>GPT32 0 DMA Request</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GPT32_REQ1</name>
                           <description>GPT32 1 DMA Request</description>
                           <value>8</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PLAREQEN</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size> 
               <description>PLA DMA Requests Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PLA_DMA_REQ0_EN</name>
                     <description>PLA DMA Request 0 Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PLA_DMA_REQ1_EN</name>
                     <description>PLA DMA Request 1 Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PLA_DMA_REQ2_EN</name>
                     <description>PLA DMA Request 2 Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PLA_DMA_REQ3_EN</name>
                     <description>PLA DMA Request 3 Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPTREQEN</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size> 
               <description>GPT/GPT32 DMA Requests Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>GPT0DMAEN</name>
                     <description>GPT 0 DMA Request Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>GPT1DMAEN</name>
                     <description>GPT 1 DMA Request Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>GPT2DMAEN</name>
                     <description>GPT 2 DMA Request Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>GPTH0DMAEN</name>
                     <description>GPT32 0 DMA Request Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>GPTH1DMAEN</name>
                     <description>GPT32 1 DMA Request Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPT_REQ_TYPE</name>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size> 
               <description>GPT and GPT32 Require Type</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>GPT_REQ0_TYPE</name>
                     <description>GPT Req0 DMA Require Type</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>high_level</name>
                           <description>High Level Trigger Interrupt and High Level Trigger DMA Request</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>rising_edge</name>
                           <description>Rising Edge Trigger Interrupt and Rising Edge Trigger DMA Request</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>low_level</name>
                           <description>Low Level Trigger Interrupt and Low Level Trigger DMA Request</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>falling_edge</name>
                           <description>Falling Edge Trigger Interrupt and Falling Edge Trigger DMA Request</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GPT_REQ1_TYPE</name>
                     <description>GPT Req1 DMA Require Type</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>high_level</name>
                           <description>High Level Trigger Interrupt and High Level Trigger DMA Request</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>rising_edge</name>
                           <description>Rising Edge Trigger Interrupt and Rising Edge Trigger DMA Request</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>low_level</name>
                           <description>Low Level Trigger Interrupt and Low Level Trigger DMA Request</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>falling_edge</name>
                           <description>Falling Edge Trigger Interrupt and Falling Edge Trigger DMA Request</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GPT_REQ2_TYPE</name>
                     <description>GPT Req2 DMA Require Type</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>high_level</name>
                           <description>High Level Trigger Interrupt and High Level Trigger DMA Request</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>rising_edge</name>
                           <description>Rising Edge Trigger Interrupt and Rising Edge Trigger DMA Request</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>low_level</name>
                           <description>Low Level Trigger Interrupt and Low Level Trigger DMA Request</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>falling_edge</name>
                           <description>Falling Edge Trigger Interrupt and Falling Edge Trigger DMA Request</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GPT32_REQ0_TYPE</name>
                     <description>GPT32 Req0 DMA Require Type</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>high_level</name>
                           <description>High Level Trigger Interrupt and High Level Trigger DMA Request</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>rising_edge</name>
                           <description>Rising Edge Trigger Interrupt and Rising Edge Trigger DMA Request</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>low_level</name>
                           <description>Low Level Trigger Interrupt and Low Level Trigger DMA Request</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>falling_edge</name>
                           <description>Falling Edge Trigger Interrupt and Falling Edge Trigger DMA Request</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GPT32_REQ1_TYPE</name>
                     <description>GPT32 Req1 DMA Require Type</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>high_level</name>
                           <description>High Level Trigger Interrupt and High Level Trigger DMA Request</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>rising_edge</name>
                           <description>Rising Edge Trigger Interrupt and Rising Edge Trigger DMA Request</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>low_level</name>
                           <description>Low Level Trigger Interrupt and Low Level Trigger DMA Request</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>falling_edge</name>
                           <description>Falling Edge Trigger Interrupt and Falling Edge Trigger DMA Request</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
