cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>UART0</name>
         <description>Unknown</description>
         <baseAddress>0x40020000</baseAddress>
         <groupName>UART0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>UART0</name>
	    <value>19</value>
	    <description>UART0</description>
	 </interrupt>
         <registers>
            <register>
               <name>RX</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size> 
               <description>Receive/transfer Buffer Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RBR</name>
                     <description>Receive Buffer Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEN</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size> 
               <description>Interrupt Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ERBFI</name>
                     <description>Receive Buffer Full Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Interrupt Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>Interrupt Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ETBEI</name>
                     <description>Transmit Buffer Empty Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Interrupt Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>Interrupt Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ELSI</name>
                     <description>Rx Status Interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Interrupt Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>Interrupt Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EDSSI</name>
                     <description>Modem Status Interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Interrupt Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>Interrupt Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EDMAT</name>
                     <description>DMA Requests in Transmit Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>DMA Requests are Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>DMA Requests are Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EDMAR</name>
                     <description>DMA Requests in Receive Mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>DMA Requests Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>DMA Requests Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>IIR</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size> 
               <description>Interrupt ID</description>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>NIRQ</name>
                     <description>Interrupt Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>STAT</name>
                     <description>Interrupt Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>MODEMINT</name>
                           <description>Modem Status Interrupt (Read MSR Register to Clear)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TXEMPTYINT</name>
                           <description>Transmit Buffer Empty Interrupt (Write to Tx Register or Read IIR Register to Clear)</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RXFULLINT</name>
                           <description>Receive Buffer Full Interrupt (Read Rx Register to Clear)</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RXLINEINT</name>
                           <description>Receive Line Status Interrupt (Read LSR Register to Clear)</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RXTIMEOUTINT</name>
                           <description>Receive FIFO Time-out Interrupt (Read Rx Register to Clear)</description>
                           <value>6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FEND</name>
                     <description>FIFO Enabled</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>FIFO Not Enabled, 16450 Mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>FIFO Enabled, 16550 Mode</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>LCR</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size> 
               <description>Line Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WLS</name>
                     <description>Word Length Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>BITS5</name>
                           <description>5 Bits</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BITS6</name>
                           <description>6 Bits</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BITS7</name>
                           <description>7 Bits</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BITS8</name>
                           <description>8 Bits</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>STOPPED</name>
                     <description>Stop Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ONTBIT</name>
                           <description>Send 1 Stop Bit Regardless of the Word Length Select Bit</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MULTIBIT</name>
                           <description>Send a Number of Stop Bits Based on the Word Length as Follows: WLS = 00, 1.5 Stop Bits Transmitted (5-bit Word Length) WLS = 01 or 10 or 11, 2 Stop Bits Transmitted (6 or 7 or 8-bit Word Length)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PEN</name>
                     <description>Parity Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Parity Will Not Be Transmitted or Checked.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>Parity Will Be Transmitted and Checked.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EPS</name>
                     <description>Parity Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ODD</name>
                           <description>Odd Parity Will Be Transmitted and Checked.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVEN</name>
                           <description>Even Parity Will Be Transmitted and Checked.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SP</name>
                     <description>Stick Parity</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STICK</name>
                           <description>Parity Will Not Be Forced Based on Parity Select and Parity Enable Bits.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EPSPEN</name>
                           <description>Parity Forced Based on Parity Select and Parity Enable Bits.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BRK</name>
                     <description>Set Break</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCR</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size> 
               <description>Modem Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DTR</name>
                     <description>Data Terminal Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FORCE1</name>
                           <description>Force NDTR to a Logic 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FORCE0</name>
                           <description>Force NDTR to a Logic 0</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RTS</name>
                     <description>Request to Send</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FORCE1</name>
                           <description>Force NRTS to a Logic 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FORCE0</name>
                           <description>Force NRTS to a Logic 0</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OUT1</name>
                     <description>Output 1</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FORCE1</name>
                           <description>Force NOUT1 to a Logic 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FORCE0</name>
                           <description>Force NOUT1 to a Logic 0</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OUT2</name>
                     <description>Output 2</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FORCE1</name>
                           <description>Force NOUT2 to a Logic 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FORCE0</name>
                           <description>Force NOUT2 to a Logic 0</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LOOPBACK</name>
                     <description>Loop Back Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Normal Operation - Loopback Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>Loopback Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
