cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
            <register>
               <name>LSR</name>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size> 
               <description>Line Status</description>
               <resetValue>0x00000060</resetValue>
               <fields>
                  <field>
                     <name>DR</name>
                     <description>Data Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOTREADY</name>
                           <description>Rx Register Does Not Contain New Receive Data.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>READY</name>
                           <description>Rx Register Contains Receive Data That Should Be Read.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OE</name>
                     <description>Overrun Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>OKAY</name>
                           <description>Receive Data Has Not Been Overwritten.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OVERWRITTEN</name>
                           <description>Receive Data Was Overwritten by New Data Before Rx Register Was Read.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PE</name>
                     <description>Parity Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOERR</name>
                           <description>No Parity Error Was Detected.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERRORS</name>
                           <description>A Parity Error Occurred on a Received Word.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FE</name>
                     <description>Framing Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>OKAY</name>
                           <description>No Invalid Stop Bit Was Detected.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INVALIDSTOP</name>
                           <description>An Invalid Stop Bit Was Detected on a Received Word.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BI</name>
                     <description>Break Indicator</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>THRE</name>
                     <description>Transmit Register Empty</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOTEMPTY</name>
                           <description>Tx Register Has Been Written to and Contains Data to Be Transmitted. Care Should Be Taken Not to Overwrite Its Value.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EMPTY</name>
                           <description>Tx Register is Empty and It is Safe to Write New Data to Tx Register the Previous Data May Not Have Been Transmitted Yet and Can Still Be Present in the Shift Register.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TEMT</name>
                     <description>Transmit and Shift Register Empty Status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOTEMPTY</name>
                           <description>Tx Register Has Been Written to and Contains Data to Be Transmitted. Care Should Be Taken Not to Overwrite Its Value.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EMPTY</name>
                           <description>Tx Register and the Transmit Shift Register are Empty and It is Safe to Write New Data to the Tx Register. Data Has Been Transmitted.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FIFOERR</name>
                     <description>FIFO Error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>MSR</name>
               <addressOffset>0x00000018</addressOffset>
               <size>32</size> 
               <description>Modem Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DCTS</name>
                     <description>Delta CTS</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOCHANGE</name>
                           <description>Clear to Send Bit Has Not Changed State Since MSR Register Was Last Read</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHANGED</name>
                           <description>Clear to Send Bit Changed State Since MSR Register Last Read</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DDSR</name>
                     <description>Delta DSR</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOCHANGE</name>
                           <description>Data Set Ready Bit Has Not Changed State Since MSR Register Was Last Read</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHANGED</name>
                           <description>Data Set Ready Bit Changed State Since MSR Register Last Read</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TERI</name>
                     <description>Trailing Edge RI</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOTCHANGED</name>
                           <description>Ring Indicator Bit Has Not Changed from 0 to 1 Since MSR Register Last Read</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHANGED</name>
                           <description>Ring Indicator Bit Changed from 0 to 1 Since MSR Register Last Read</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DDCD</name>
                     <description>Delta DCD</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOCHANGE</name>
                           <description>Data Carrier Detect Bit Has Not Changed State Since MSR Register Was Last Read</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHANGED</name>
                           <description>Data Carrier Detect Bit Changed State Since MSR Register Last Read</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CTS</name>
                     <description>Clear to Send</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>NCTS is Currently Logic High</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>NCTS is Currently Logic Low</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DSR</name>
                     <description>Data Set Ready</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>NDSR is Currently Logic High</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>NDSR is Currently Logic Low</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RI</name>
                     <description>Ring Indicator</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>NRI is Currently Logic High.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>NRI is Currently Logic Low.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DCD</name>
                     <description>Data Carrier Detect</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>NDCD is Currently Logic High.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>NDCD is Currently Logic Low.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCR</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>32</size> 
               <description>Scratch Buffer</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCR</name>
                     <description>Scratch</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCR</name>
               <addressOffset>0x00000020</addressOffset>
               <size>32</size> 
               <description>FIFO Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FIFOEN</name>
                     <description>FIFO Enable as to Work in 16550 Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>RFCLR</name>
                     <description>Clear RX FIFO</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TFCLR</name>
                     <description>Clear TX FIFO</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>FDMAMD</name>
                     <description>FIFO DMA Mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>MODE0</name>
                           <description>In DMA Mode 0, RX DMA Request Will Be Asserted Whenever There&#39;s Data in RBR or RX FIFO and De-assert Whenever RBR or RX FIFO is Empty; TX DMA Request Will Be Asserted Whenever THR or TX FIFO is Empty and De-assert Whenever Data Written To.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MODE1</name>
                           <description>In DMA Mode 1, RX DMA Request Will Be Asserted Whenever RX FIFO Trig Level or Time Out Reached and De-assert Thereafter When RX FIFO is Empty; TX DMA Request Will Be Asserted Whenever TX FIFO is Empty and De-assert Thereafter When TX FIFO is Completely Filled up Full.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RFTRIG</name>
                     <description>RX FIFO Trig Level</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>BYTE1</name>
                           <description>1 Byte to Trig RX Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BYTE4</name>
                           <description>4 Byte to Trig RX Interrupt</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BYTE8</name>
                           <description>8 Byte to Trig RX Interrupt</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BYTE14</name>
                           <description>14 Byte to Trig RX Interrupt</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FBR</name>
               <addressOffset>0x00000024</addressOffset>
               <size>32</size> 
               <description>Fractional Baud Rate</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIVN</name>
                     <description>Fractional Baud Rate N Divide Bits 0 to 2047</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000007FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>DIVM</name>
                     <description>Fractional Baud Rate M Divide Bits 1 to 3</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>FBEN</name>
                     <description>Fractional Baud Rate Generator Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>DIV</name>
               <addressOffset>0x00000028</addressOffset>
               <size>32</size> 
               <description>Baudrate Divider</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>Baud Rate Divider</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
