cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
            <register>
               <name>LCR2</name>
               <addressOffset>0x0000002C</addressOffset>
               <size>32</size> 
               <description>Second Line Control</description>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>OSR</name>
                     <description>Over Sample Rate</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>OSR4</name>
                           <description>Over Sample by 4</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR8</name>
                           <description>Over Sample by 8</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR16</name>
                           <description>Over Sample by 16</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR32</name>
                           <description>Over Sample by 32</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL</name>
               <addressOffset>0x00000030</addressOffset>
               <size>32</size> 
               <description>UART Control Register</description>
               <resetValue>0x00000100</resetValue>
               <fields>
                  <field>
                     <name>FORCECLK</name>
                     <description>Force UCLK on</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GATEUCLK</name>
                           <description>UCLK Automatically Gated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UCLKEN</name>
                           <description>UCLK Always Working</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXINV</name>
                     <description>Invert Receiver Line</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>EN000</name>
                           <description>Don&#39;t Invert Receiver Line (idling High)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN001</name>
                           <description>Invert Receiver Line (idling Low)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>REV</name>
                     <description>UART Revision ID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>RFC</name>
               <addressOffset>0x00000034</addressOffset>
               <size>32</size> 
               <description>RX FIFO Byte Count</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RFC</name>
                     <description>Current RX FIFO Data Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>TFC</name>
               <addressOffset>0x00000038</addressOffset>
               <size>32</size> 
               <description>TX FIFO Byte Count</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TFC</name>
                     <description>Current TX FIFO Data Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>RSC</name>
               <addressOffset>0x0000003C</addressOffset>
               <size>32</size> 
               <description>RS485 Half-duplex Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OENP</name>
                     <description>SOUT_EN Polarity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>HIGHACTIVE</name>
                           <description>High Active</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOWACTIVE</name>
                           <description>Low Active</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OENSP</name>
                     <description>SOUT_EN De-assert Before Full Stop Bit(s)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FULLBIT</name>
                           <description>SOUT_EN De-assert Same Time as Full Stop Bit(s)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HALFBIT</name>
                           <description>SOUT_EN De-assert Half-bit Earlier Than Full Stop Bit(s)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DISRX</name>
                     <description>Disable RX When Transmitting</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>DISTX</name>
                     <description>Hold off TX When Receiving</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACR</name>
               <addressOffset>0x00000040</addressOffset>
               <size>32</size> 
               <description>Auto Baud Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ABE</name>
                     <description>Auto Baud Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>DNIEN</name>
                     <description>Enable Done Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TOIEN</name>
                     <description>Enable Time-out Interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SEC</name>
                     <description>Starting Edge Count</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FIRST</name>
                           <description>First Edge (always the Falling Edge of START Bit)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SECOND</name>
                           <description>Second Edge</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THIRD</name>
                           <description>Third Edge</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FOURTH</name>
                           <description>Fourth Edge</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FIFTH</name>
                           <description>Fifth Edge</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SIXTH</name>
                           <description>Sixth Edge</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEVENTH</name>
                           <description>Seventh Edge</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EIGHTH</name>
                           <description>Eighth Edge</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EEC</name>
                     <description>Ending Edge Count</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FIRST</name>
                           <description>First Edge</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SECOND</name>
                           <description>Second Edge</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THIRD</name>
                           <description>Third Edge</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FOURTH</name>
                           <description>Fourth Edge</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FIFTH</name>
                           <description>Fifth Edge</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SIXTH</name>
                           <description>Sixth Edge</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEVENTH</name>
                           <description>Seventh Edge</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EIGHTH</name>
                           <description>Eighth Edge</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NINTH</name>
                           <description>Ninth Edge</description>
                           <value>8</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ASRL</name>
               <addressOffset>0x00000044</addressOffset>
               <size>32</size> 
               <description>Auto Baud Status (Low)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>Auto Baud Done Successfully</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>BRKTO</name>
                     <description>Timed Out Due to Long Time Break Condition</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NSETO</name>
                     <description>Timed Out Due to No Valid Start Edge Found</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NEETO</name>
                     <description>Timed Out Due to No Valid Ending Edge Found</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CNT</name>
                     <description>Auto Baud Counter Value</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ASRH</name>
               <addressOffset>0x00000048</addressOffset>
               <size>32</size> 
               <description>Auto Baud Status (High)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNT</name>
                     <description>Auto Baud Counter Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
