cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="UART0">
         <name>UART1</name>
         <baseAddress>0x40020400</baseAddress>
	 <interrupt>
	    <name>UART1</name>
	    <value>20</value>
	    <description>UART1</description>
	 </interrupt>
      </peripheral>
      <peripheral>
         <name>I2C0</name>
         <description>Some Description.</description>
         <baseAddress>0x40020800</baseAddress>
         <groupName>I2C0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000080</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>I2C0S</name>
	    <value>24</value>
	    <description>I2C0S</description>
	 </interrupt>
	 <interrupt>
	    <name>I2C0M</name>
	    <value>25</value>
	    <description>I2C0M</description>
	 </interrupt>
         <registers>
            <register>
               <name>MCTL</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size> 
               <description>Master Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MASEN</name>
                     <description>Master Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>COMPETE</name>
                     <description>Start Back-off Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>LOOPBACK</name>
                     <description>Internal Loopback Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IENMRX</name>
                     <description>Receive Request Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IENMTX</name>
                     <description>Transmit Request Interrupt Enable.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IENALOST</name>
                     <description>Arbitration Lost Interrupt Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IENACK</name>
                     <description>ACK Not Received Interrupt Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IENCMP</name>
                     <description>Transaction Completed (Or Stop Detected) Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MXMITDEC</name>
                     <description>Decrement Master TX FIFO Status When Transmitted One Byte</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MRXDMA</name>
                     <description>Enable Master Rx DMA Request</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MTXDMA</name>
                     <description>Enable Master Tx DMA Request</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>BUS_CLR_EN</name>
                     <description>Bus-Clear Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PRESTOP_BUS_CLR</name>
                     <description>Prestop Bus-Clear</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>MSTAT</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size> 
               <description>Master Status</description>
               <resetValue>0x00006000</resetValue>
               <fields>
                  <field>
                     <name>MTXFSTA</name>
                     <description>Master Transmit FIFO Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>MTXREQ</name>
                     <description>Master Transmit Interrupt Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MRXREQ</name>
                     <description>Master Receive Request</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NACKADDR</name>
                     <description>ACK Not Received in Response to an Address</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ALOST</name>
                     <description>Arbitration Lost</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>MBUSY</name>
                     <description>Master Busy</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NACKDATA</name>
                     <description>ACK Not Received in Response to Data Write</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TCOMP</name>
                     <description>Transaction Complete or Stop Detected</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>MRXOF</name>
                     <description>Master Receive FIFO Overflow</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LINEBUSY</name>
                     <description>Line is Busy</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>MSTOP</name>
                     <description>STOP Driven by This I2C Master</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>MTXUFLOW</name>
                     <description>Master Transmit Underflow</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SDA_FILTERED</name>
                     <description>State of SDA Line</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SCL_FILTERED</name>
                     <description>State of SCL Line</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>MSTR_HS_MODE</name>
                     <description>Master High Speed Mode Flag</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>MRX</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size> 
               <description>Master Receive Data</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ICMRX</name>
                     <description>Master Receive Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>MTX</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size> 
               <description>Master Transmit Data</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>I2CMRX</name>
                     <description>Master Transmit Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>MRXCNT</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size> 
               <description>Master Receive Data Count</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Receive Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>EXTEND</name>
                     <description>Extended Read</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCRXCNT</name>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size> 
               <description>Master Current Receive Data Count</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Current Receive Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADDR0</name>
               <addressOffset>0x00000018</addressOffset>
               <size>32</size> 
               <description>1st Master Address Byte</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADR1</name>
                     <description>Address Byte 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADDR1</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>32</size> 
               <description>2nd Master Address Byte</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADR2</name>
                     <description>Address Byte 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>BYT</name>
               <addressOffset>0x00000020</addressOffset>
               <size>32</size> 
               <description>Start Byte</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SBYTE</name>
                     <description>Start Byte</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>DIV</name>
               <addressOffset>0x00000024</addressOffset>
               <size>32</size> 
               <description>Serial Clock Period Divisor</description>
               <resetValue>0x0000C6C7</resetValue>
               <fields>
                  <field>
                     <name>LOW</name>
                     <description>Serial Clock Low Time</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>HIGH</name>
                     <description>Serial Clock High Time</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
