cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
            <register>
               <name>SCTL</name>
               <addressOffset>0x00000028</addressOffset>
               <size>32</size> 
               <description>Slave Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLVEN</name>
                     <description>Slave Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>ADR10EN</name>
                     <description>Enabled 10-bit Addressing</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>GCEN</name>
                     <description>General Call Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>HGCEN</name>
                     <description>Hardware General Call Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>GCSBCLR</name>
                     <description>General Call Status Bit Clear</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>EARLYTXR</name>
                     <description>Early Transmit Request Mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>NACK</name>
                     <description>NACK Next Communication</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IENSTOP</name>
                     <description>Stop Condition Detected Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IENSRX</name>
                     <description>Slave Receive Request Interrupt Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IENSTX</name>
                     <description>Slave Transmit Request Interrupt Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SXMITDEC</name>
                     <description>Decrement Slave Tx FIFO Status When Transmitted a Byte</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IENREPST</name>
                     <description>Repeated Start Interrupt Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SRXDMA</name>
                     <description>Enable Slave Rx DMA Request</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>STXDMA</name>
                     <description>Enable Slave Tx DMA Request</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>ID_FIFO_EN</name>
                     <description>ID FIFO Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SSTAT</name>
               <addressOffset>0x0000002C</addressOffset>
               <size>32</size> 
               <description>Slave I2C Status/Error/IRQ</description>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>STXFSEREQ</name>
                     <description>Slave Tx FIFO Status or Early Request</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>STXUR</name>
                     <description>Slave Transmit FIFO Underflow</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>STXREQ</name>
                     <description>Slave Transmit Interrupt Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SRXREQ</name>
                     <description>Slave Receive Request</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SRXOF</name>
                     <description>Slave Receive FIFO Overflow</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NOACK</name>
                     <description>Ack Not Generated by the Slave</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SBUSY</name>
                     <description>Slave Busy</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>GCINT</name>
                     <description>General Call Interrupt</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>GCID</name>
                     <description>General ID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No general call</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESETPROGADDR</name>
                           <description>General call Reset and Program Address</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PROGADDR</name>
                           <description>General Call Program Address</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MATCHID</name>
                           <description>General Call Matching Alternative ID</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>STOP</name>
                     <description>Stop After Start and Matching Address</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>IDMAT</name>
                     <description>Device ID Matched</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ID0</name>
                           <description>Received Address Matched ID Register 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ID1</name>
                           <description>Received Address Matched ID Register 1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ID2</name>
                           <description>Received Address Matched ID Register 2</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ID3</name>
                           <description>Received Address Matched ID Register 3</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>REPSTART</name>
                     <description>Repeated Start and Matching Address</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>START</name>
                     <description>Start and Matching Address</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SLV_HS_MODE</name>
                     <description>Slave High Speed Mode Flag</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRX</name>
               <addressOffset>0x00000030</addressOffset>
               <size>32</size> 
               <description>Slave Receive</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>I2CSRX</name>
                     <description>Slave Receive Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>STX</name>
               <addressOffset>0x00000034</addressOffset>
               <size>32</size> 
               <description>Slave Transmit</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>I2CSTX</name>
                     <description>Slave Transmit Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>ID_SEL</name>
                     <description>ID FIFO Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FIFO0</name>
                           <description>Select Address Matched ID Register 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FIFO1</name>
                           <description>Select Address Matched ID Register 1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FIFO2</name>
                           <description>Select Address Matched ID Register 2</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FIFO3</name>
                           <description>Select Address Matched ID Register 3</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ALT</name>
               <addressOffset>0x00000038</addressOffset>
               <size>32</size> 
               <description>Hardware General Call ID</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ALT</name>
                     <description>Slave Alt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ID0</name>
               <addressOffset>0x0000003C</addressOffset>
               <size>32</size> 
               <description>1st Slave Address Device ID</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ID0</name>
                     <description>Slave Device ID 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ID1</name>
               <addressOffset>0x00000040</addressOffset>
               <size>32</size> 
               <description>2nd Slave Address Device ID</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ID1</name>
                     <description>Slave Device ID 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ID2</name>
               <addressOffset>0x00000044</addressOffset>
               <size>32</size> 
               <description>3rd Slave Address Device ID</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ID2</name>
                     <description>Slave Device ID 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ID3</name>
               <addressOffset>0x00000048</addressOffset>
               <size>32</size> 
               <description>4th Slave Address Device ID</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ID3</name>
                     <description>Slave Device ID 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
