cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
            <register>
               <name>STAT</name>
               <addressOffset>0x0000004C</addressOffset>
               <size>32</size> 
               <description>Master and Slave FIFO Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STXFSTA</name>
                     <description>Slave Transmit FIFO Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>EMPTY</name>
                           <description>FIFO Empty</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ONE</name>
                           <description>1 Bytes in the FIFO</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TWO</name>
                           <description>2 Bytes in the FIFO</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRXFSTA</name>
                     <description>Slave Receive FIFO Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>EMPTY</name>
                           <description>FIFO Empty</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ONE</name>
                           <description>1 Bytes in the FIFO</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TWO</name>
                           <description>2 Bytes in the FIFO</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MTXSFA</name>
                     <description>Master Transmit FIFO Status</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>EMPTY</name>
                           <description>FIFO Empty</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ONE</name>
                           <description>1 Bytes in the FIFO</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TWO</name>
                           <description>2 Bytes in the FIFO</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MRXFSTA</name>
                     <description>Master Receive FIFO Status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>EMPTY</name>
                           <description>FIFO Empty</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ONE</name>
                           <description>1 Bytes In The FIFO</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TWO</name>
                           <description>2 Bytes in the FIFO</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SFLUSH</name>
                     <description>Flush the Slave Transmit FIFO</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MFLUSH</name>
                     <description>Flush the Master Transmit FIFO</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>STX_FLUSH_ALL</name>
                     <description>Flush All the Slave Transmit ID FIFOs.</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHCTL</name>
               <addressOffset>0x00000050</addressOffset>
               <size>32</size> 
               <description>Shared Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RESET</name>
                     <description>Reset START STOP Detect Circuit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>ADR_BUSY</name>
                     <description>ADR Busy Flag</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SDA_DLY</name>
                     <description>Delay Between SDAOUT and SDAOEN</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SCL_DLY</name>
                     <description>Delay Between SCLOUT and SCLOEN</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>TCTL</name>
               <addressOffset>0x00000054</addressOffset>
               <size>32</size> 
               <description>Timing Control Register</description>
               <resetValue>0x00000205</resetValue>
               <fields>
                  <field>
                     <name>THDATIN</name>
                     <description>Data in Hold Start</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000003F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>FILTEROFF</name>
                     <description>Input Filter Control</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PRE_DIV</name>
                     <description>Presale Divide Counter for SCK DIV</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000007</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>FILTER_TICKS</name>
                     <description>SCK &amp; SDA Gglitch Filter Ticks.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ASTRETCH_SCL</name>
               <addressOffset>0x00000058</addressOffset>
               <size>32</size> 
               <description>Automatic Stretch SCL Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>stretch_mode_mas</name>
                     <description>Master Automatic Stretch Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>strecth_mode_slv</name>
                     <description>Slave Automatic Stretch Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>timeout_sscl_mas</name>
                     <description>Master Automatic Stretch Timeout</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>timeout_sscl_slv</name>
                     <description>Slave Automatic Stretch Timeout</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>MAN_RLS_EN</name>
                     <description>Manual Release Stretch Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>sscl_after_ack</name>
                     <description>Slave RX Stretch After ACK Mode</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SSCL_RLS</name>
                     <description>Slave Manual Clear Stretch</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>addr_ack_ien</name>
                     <description>Slave ADDRESS ACK Interruption Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>sscl_irq_ien</name>
                     <description>Slave Stretch Interruption Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>clr_addr_ack_irq</name>
                     <description>Write Clear the Address ACK IRQ.</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
