cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
            <register>
               <name>IDFSTA</name>
               <addressOffset>0x0000005C</addressOffset>
               <size>32</size> 
               <description>ID FIFO Status Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STX0FSTA</name>
                     <description>Slave Transmit ID0 FIFO Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>EMPTY</name>
                           <description>FIFO Empty</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ONE</name>
                           <description>1 Bytes in the FIFO</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TWO</name>
                           <description>2 Bytes in the FIFO</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>STX1FSTA</name>
                     <description>Slave Transmit ID1 FIFO Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>EMPTY</name>
                           <description>FIFO Empty</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ONE</name>
                           <description>1 Bytes in the FIFO</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TWO</name>
                           <description>2 Bytes in the FIFO</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>STX2FSTA</name>
                     <description>Slave Transmit ID2 FIFO Status</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>EMPTY</name>
                           <description>FIFO Empty</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ONE</name>
                           <description>1 Bytes in the FIFO</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TWO</name>
                           <description>2 Bytes in the FIFO</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>STX3FSTA</name>
                     <description>Slave Transmit ID3 FIFO Status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>EMPTY</name>
                           <description>FIFO Empty</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ONE</name>
                           <description>1 Bytes in the FIFO</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TWO</name>
                           <description>2 Bytes in the FIFO</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SFLUSH0</name>
                     <description>Flush the Slave Transmit ID0 FIFO</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SFLUSH1</name>
                     <description>Flush the Slave Transmit ID1 FIFO</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SFLUSH2</name>
                     <description>Flush the Slave Transmit ID2 FIFO</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SFLUSH3</name>
                     <description>Flush the Slave Transmit ID3 FIFO</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>STX0UR</name>
                     <description>Slave Transmit ID0 FIFO Underflow</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>STX1UR</name>
                     <description>Slave Transmit ID1 FIFO Underflow</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>STX2UR</name>
                     <description>Slave Transmit ID2 FIFO Underflow</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>STX3UR</name>
                     <description>Slave Transmit ID3 FIFO Underflow</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SLV_ADDR1</name>
               <addressOffset>0x00000060</addressOffset>
               <size>32</size> 
               <description>Slave 10 Bits Address 1st Byte.</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLV_ADR1</name>
                     <description>Slave 10 Bits Address 1st Byte</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SLV_ADDR2</name>
               <addressOffset>0x00000064</addressOffset>
               <size>32</size> 
               <description>Slave 10 Bits Address 2nd Byte.</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLV_ADR2</name>
                     <description>Slave 10 Bit Address 2nd Byte</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SSTAT2</name>
               <addressOffset>0x00000068</addressOffset>
               <size>32</size> 
               <description>Slave I2C Status/IRQ 2</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>sscl_irq</name>
                     <description>Stretch Interruption State.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>addr_ack_irq</name>
                     <description>Slave ADDR ACK Interruption State.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>rw_direction</name>
                     <description>Slave I2C RW Direction.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
