cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="I2C0">
         <name>I2C1</name>
         <baseAddress>0x40020C00</baseAddress>
	 <interrupt>
	    <name>I2C1S</name>
	    <value>26</value>
	    <description>I2C1S</description>
	 </interrupt>
	 <interrupt>
	    <name>I2C1M</name>
	    <value>27</value>
	    <description>I2C1M</description>
	 </interrupt>
      </peripheral>
      <peripheral derivedFrom="I2C0">
         <name>I2C2</name>
         <baseAddress>0x40021000</baseAddress>
	 <interrupt>
	    <name>I2C2S</name>
	    <value>28</value>
	    <description>I2C2S</description>
	 </interrupt>
	 <interrupt>
	    <name>I2C2M</name>
	    <value>29</value>
	    <description>I2C2M</description>
	 </interrupt>
      </peripheral>
      <peripheral>
         <name>MDIO</name>
         <description>Unknown</description>
         <baseAddress>0x40022000</baseAddress>
         <groupName>MDIO</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000040</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>MDIO</name>
	    <value>17</value>
	    <description>MDIO</description>
	 </interrupt>
         <registers>
            <register>
               <name>MDCON</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size> 
               <description>MDIO Block Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MD_RST</name>
                     <description>Write 1 to Reset MDIO Block.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RSTINACTIVE</name>
                           <description>Reset MDIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RSTACTIVE</name>
                           <description>Reset MDIO</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MD_PHM</name>
                     <description>Enable PHY Address Bit Width</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>EN_5bit</name>
                           <description>5bits PHYADD is active</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN_3bits</name>
                           <description>3bits PHYADD is active, two MSBS are ignored</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MD_DRV</name>
                     <description>Enable Open-drain or Push-pull of MDIO Drive</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>MD_DRV_OD</name>
                           <description>MDIO Drive Open Drain.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MD_DRV_PP</name>
                           <description>MDIO Drive Push-pull.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MD_EN</name>
                     <description>MD Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDFRM</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size> 
               <description>MDIO Received Frame Control Information</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MD_OP</name>
                     <description>Received OP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>MD_OP_ADF</name>
                           <description>Address Frame.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MD_OP_WRF</name>
                           <description>Write Frame.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MD_OP_INCF</name>
                           <description>PostReadIncAdd Frame.</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MD_OP_RDF</name>
                           <description>Read Frame.</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MD_PHY</name>
                     <description>Received PHYADR.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>MD_DEV</name>
                     <description>Received DEVADD</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDRXD</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size> 
               <description>MDIO Received Data</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MD_RXD</name>
                     <description>Received Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDADR</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size> 
               <description>MDIO Received Address</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MD_ADR</name>
                     <description>Received Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDTXD</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size> 
               <description>MDIO Data for Transmission</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MD_TXD</name>
                     <description>TX Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDPHY</name>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size> 
               <description>MDIO PHYADDR Software Values and Selection and DEVADD</description>
               <resetValue>0x00000400</resetValue>
               <fields>
                  <field>
                     <name>MD_PHYSW</name>
                     <description>Software Provided PHYADR</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000001F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MD_PHYSEL</name>
                     <description>Selects Expected PHYADR Bits</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000001F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MD_DEVADD</name>
                     <description>Expected DEVADD</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000001F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDSTA</name>
               <addressOffset>0x00000018</addressOffset>
               <size>32</size> 
               <description>MDIO Progress Signaling Through Frame</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MD_WRF</name>
                     <description>Write Frame Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>MD_ADRF</name>
                     <description>Address Frame Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>MD_INCF</name>
                     <description>Post Read Increment Address Frame Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>MD_RDF</name>
                     <description>Read Frame Status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>MD_DEVM</name>
                     <description>Device Address Matching Status</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>MD_DEVN</name>
                     <description>Device Address None Match Status</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>MD_PHYM</name>
                     <description>PHY Address Matching Status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>MD_PHYN</name>
                     <description>PHY Address Non Matching Status</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIEN</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>32</size> 
               <description>MDIO Interrupt Enables</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MD_WRFI</name>
                     <description>Interrupt Enable for MD_WRF</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MD_ADRI</name>
                     <description>Interrupt Enable for MD_ADRF</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MD_INCFI</name>
                     <description>Interrupt Enable for MD_INCF</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MD_RDFI</name>
                     <description>Interrupt Enable for MD_RDF</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MD_DEVMI</name>
                     <description>Interrupt Enable for MD_DEVM</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MD_DEVNI</name>
                     <description>Interrupt Enable for MD_DEVN</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MD_PHYMI</name>
                     <description>Interrupt Enable for MD_PHYM</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MD_PHYNI</name>
                     <description>Interrupt Enable for MD_PHYN</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDPIN</name>
               <addressOffset>0x00000020</addressOffset>
               <size>32</size> 
               <description>MDIO Read PHYADDR Pins</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MD_PIN</name>
                     <description>PRTADR Pins</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMAEN</name>
               <addressOffset>0x00000028</addressOffset>
               <size>32</size> 
               <description>MDIO DMA Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RD_DATA</name>
                     <description>Read Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>INCRD_DATA</name>
                     <description>Increment Read Data</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>WR_ADR</name>
                     <description>Write Address</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>WR_DATA</name>
                     <description>Write Data</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
