cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
            <register>
               <name>IEN</name>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size> 
               <description>SPI Configuration 2</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IRQMODE</name>
                     <description>SPI IRQ Mode Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>TX1RX1</name>
                           <description>Interrupt Occurs After 1 Byte is Transfered or Received</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TX2RX2</name>
                           <description>Interrupt Occurs After 2 Byte is Transfered or Received</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TX3RX3</name>
                           <description>Interrupt Occurs After 3 Byte is Transfered or Received</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TX4RX4</name>
                           <description>Interrupt Occurs After 4 Byte is Transfered or Received</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TX5RX5</name>
                           <description>Interrupt Occurs After 5 Byte is Transfered or Received</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TX6RX6</name>
                           <description>Interrupt Occurs After 6 Byte is Transfered or Received</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TX7RX7</name>
                           <description>Interrupt Occurs After 7 Byte is Transfered or Received</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TX8RX8</name>
                           <description>Interrupt Occurs After 8 Byte is Transfered or Received</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CS</name>
                     <description>Enable Interrupt on Every CS Edge in Slave CON Mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TXUNDR</name>
                     <description>Tx-underflow Interrupt Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>RXOVR</name>
                     <description>Rx-overflow Interrupt Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>RDY</name>
                     <description>Ready Signal Edge Interrupt Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TXDONE</name>
                     <description>SPI Transmit Done Interrupt Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>XFRDONE</name>
                     <description>SPI Transfer Completion Interrupt Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>Tx-FIFO Empty Interrupt Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNT</name>
               <addressOffset>0x00000018</addressOffset>
               <size>32</size> 
               <description>Transfer Byte Count</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUES</name>
                     <description>Transfer Byte Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00003FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>FRAMECONT</name>
                     <description>Continue Frame</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMA</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>32</size> 
               <description>SPI DMA Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>Enable DMA for Data Transfer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TXEN</name>
                     <description>Enable Transmit DMA Request</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>RXEN</name>
                     <description>Enable Receive DMA Request</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>FIFOSTAT</name>
               <addressOffset>0x00000020</addressOffset>
               <size>32</size> 
               <description>FIFO Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TX</name>
                     <description>SPI Tx FIFO Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>EMPTY</name>
                           <description>Tx FIFO Empty</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ONE</name>
                           <description>1 Valid Byte/half-word in Tx FIFO</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TWO</name>
                           <description>2 Valid Bytes/half-words in Tx FIFO</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THREE</name>
                           <description>3 Valid Bytes/half-words in Tx FIFO</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FOUR</name>
                           <description>4 Valid Bytes/half-words in Tx FIFO</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FIVE</name>
                           <description>5 Valid Bytes/half-words in Tx FIFO</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SIX</name>
                           <description>6 Valid Bytes/half-words in Tx FIFO</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEVEN</name>
                           <description>7 Valid Bytes/half-words in Tx FIFO</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FULL</name>
                           <description>8 Valid Bytes/half-words in Tx FIFO (Tx FIFO Full)</description>
                           <value>8</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX</name>
                     <description>SPI Rx FIFO Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>EMPTY</name>
                           <description>Rx FIFO Empty</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ONE</name>
                           <description>1 Valid Byte/half-word in Rx FIFO</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TWO</name>
                           <description>2 Valid Bytes/half-words in Rx FIFO</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THREE</name>
                           <description>3 Valid Bytes/half-words in Rx FIFO</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FOUR</name>
                           <description>4 Valid Bytes/half-words in Rx FIFO</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FIVE</name>
                           <description>5 Valid Bytes/half-words in Rx FIFO</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SIX</name>
                           <description>6 Valid Bytes/half-words in Rx FIFO</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEVEN</name>
                           <description>7 Valid Bytes/half-words in Rx FIFO</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FULL</name>
                           <description>8 Valid Bytes/half-words in Rx FIFO (Rx FIFO Full)</description>
                           <value>8</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RDCTL</name>
               <addressOffset>0x00000024</addressOffset>
               <size>32</size> 
               <description>Read Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CMDEN</name>
                     <description>Read Command Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>OVERLAP</name>
                     <description>Tx/Rx Overlap Mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TXBYTES</name>
                     <description>Transmit Byte Count Minus 1 for Read Command</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>THREEPIN</name>
                     <description>Three Pin SPI Mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLOWCTL</name>
               <addressOffset>0x00000028</addressOffset>
               <size>32</size> 
               <description>Flow Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MODE</name>
                     <description>Flow Control Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Flow Control is Disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIMER</name>
                           <description>Flow Control is Based on Timer (WAIT_TMR).</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RDY</name>
                           <description>Flow Control is Based on RDY Signal.</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MISO</name>
                           <description>Flow Control is Based on MISO Pin.</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RDYPOL</name>
                     <description>Polarity of RDY/MISO Line</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>Polarity is Active HIGH. SPI Master Waits Until RDY/MISO Becomes HIGH.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Polarity is Active LOW. SPI Master Waits Until RDY/MISO Becomes LOW.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RDBURSTSZ</name>
                     <description>Read Data Burst Size Minus 1</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>10</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000003FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>WAITTMR</name>
               <addressOffset>0x0000002C</addressOffset>
               <size>32</size> 
               <description>Wait Timer for Flow Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TRIMS</name>
                     <description>Wait Timer for Flow-control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
