cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
            <register>
               <name>CSOVERRIDE</name>
               <addressOffset>0x00000034</addressOffset>
               <size>32</size> 
               <description>Chip-Select Override</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CTL</name>
                     <description>CS Override Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOTFORCE</name>
                           <description>CS is Not Forced.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FORCETO1</name>
                           <description>CS is Forced to Drive 1&#39;b1.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FORCETO0</name>
                           <description>CS is Forced to Drive 1&#39;b0.</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral derivedFrom="D2D0">
         <name>D2D1</name>
         <baseAddress>0x40028000</baseAddress>
	 <interrupt>
	    <name>HVD2D</name>
	    <value>76</value>
	    <description>HVD2D</description>
	 </interrupt>
      </peripheral>
      <peripheral derivedFrom="D2D0">
         <name>SPI0</name>
         <baseAddress>0x40054000</baseAddress>
	 <interrupt>
	    <name>SPI0</name>
	    <value>21</value>
	    <description>SPI0</description>
	 </interrupt>
      </peripheral>
      <peripheral derivedFrom="D2D0">
         <name>SPI1</name>
         <baseAddress>0x40058000</baseAddress>
	 <interrupt>
	    <name>SPI1</name>
	    <value>22</value>
	    <description>SPI1</description>
	 </interrupt>
      </peripheral>
      <peripheral derivedFrom="D2D0">
         <name>SPI2</name>
         <baseAddress>0x4005C000</baseAddress>
	 <interrupt>
	    <name>SPI2</name>
	    <value>23</value>
	    <description>SPI2</description>
	 </interrupt>
      </peripheral>
      <peripheral>
         <name>DMA</name>
         <description>DMA</description>
         <baseAddress>0x40040000</baseAddress>
         <groupName>DMA</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00001000</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>DMA_ERR</name>
	    <value>40</value>
	    <description>DMA_ERR</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_SPI0_TX</name>
	    <value>41</value>
	    <description>DMA_SPI0_TX</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_SPI0_RX</name>
	    <value>42</value>
	    <description>DMA_SPI0_RX</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_SPI1_TX</name>
	    <value>43</value>
	    <description>DMA_SPI1_TX</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_SPI1_RX</name>
	    <value>44</value>
	    <description>DMA_SPI1_RX</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_SPI2_TX</name>
	    <value>45</value>
	    <description>DMA_SPI2_TX</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_SPI2_RX</name>
	    <value>46</value>
	    <description>DMA_SPI2_RX</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_UART0_TX</name>
	    <value>47</value>
	    <description>DMA_UART0_TX</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_UART0_RX</name>
	    <value>48</value>
	    <description>DMA_UART0_RX</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_UART1_TX</name>
	    <value>49</value>
	    <description>DMA_UART1_TX</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_UART1_RX</name>
	    <value>50</value>
	    <description>DMA_UART1_RX</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_I2C0S_TX</name>
	    <value>51</value>
	    <description>DMA_I2C0S_TX</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_I2C0S_RX</name>
	    <value>52</value>
	    <description>DMA_I2C0S_RX</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_I2C0M</name>
	    <value>53</value>
	    <description>DMA_I2C0M</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_I2C1S_TX</name>
	    <value>54</value>
	    <description>DMA_I2C1S_TX</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_I2C1S_RX</name>
	    <value>55</value>
	    <description>DMA_I2C1S_RX</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_I2C1M</name>
	    <value>56</value>
	    <description>DMA_I2C1M</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_I2C2S_TX</name>
	    <value>57</value>
	    <description>DMA_I2C2S_TX</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_I2C2S_RX</name>
	    <value>58</value>
	    <description>DMA_I2C2S_RX</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_I2C2M</name>
	    <value>59</value>
	    <description>DMA_I2C2M</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_MDIO_TX</name>
	    <value>60</value>
	    <description>DMA_MDIO_TX</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_MDIO_RX</name>
	    <value>61</value>
	    <description>DMA_MDIO_RX</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_FLASH</name>
	    <value>62</value>
	    <description>DMA_FLASH</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_ADC</name>
	    <value>63</value>
	    <description>DMA_ADC</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_SPI_LV_TX</name>
	    <value>77</value>
	    <description>DMA_SPI_LV_TX</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_SPI_LV_RX</name>
	    <value>78</value>
	    <description>DMA_SPI_LV_RX</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_SPI_HV_TX</name>
	    <value>79</value>
	    <description>DMA_SPI_HV_TX</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_SPI_HV_RX</name>
	    <value>80</value>
	    <description>DMA_SPI_HV_RX</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_TRIG0</name>
	    <value>81</value>
	    <description>DMA_TRIG0</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_TRIG1</name>
	    <value>82</value>
	    <description>DMA_TRIG1</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_SW0</name>
	    <value>83</value>
	    <description>DMA_SW0</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA_SW1</name>
	    <value>84</value>
	    <description>DMA_SW1</description>
	 </interrupt>
         <registers>
            <register>
               <name>STAT</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>DMA Status</description>
               <resetValue>0x001E0000</resetValue>
               <fields>
                  <field>
                     <name>MEN</name>
                     <description>Enable Status of the Controller</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CHANM1</name>
                     <description>Number of Available DMA Channels Minus 1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFG</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <description>DMA Configuration</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MEN</name>
                     <description>Controller Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDBPTR</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <description>DMA Channel Primary Control Data Base Pointer</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Pointer to the Base Address of the Primary Data Structure</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADBPTR</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <description>DMA Channel Alternate Control Data Base Pointer</description>
               <resetValue>0x00000200</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Base Address of the Alternate Data Structure</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWREQ</name>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size>
               <description>DMA Channel Software Request</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Generate Software Request</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>31</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x7FFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>RMSKSET</name>
               <addressOffset>0x00000020</addressOffset>
               <size>32</size>
               <description>DMA Channel Request Mask Set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Mask Requests from DMA Channels</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>31</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x7FFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>RMSKCLR</name>
               <addressOffset>0x00000024</addressOffset>
               <size>32</size>
               <description>DMA Channel Request Mask Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Clear REQ_MASK_SET Bits in DMARMSKSET</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>31</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x7FFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ENSET</name>
               <addressOffset>0x00000028</addressOffset>
               <size>32</size>
               <description>DMA Channel Enable Set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Enable DMA Channels</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>31</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x7FFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ENCLR</name>
               <addressOffset>0x0000002C</addressOffset>
               <size>32</size>
               <description>DMA Channel Enable Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Disable DMA Channels</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>31</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x7FFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ALTSET</name>
               <addressOffset>0x00000030</addressOffset>
               <size>32</size>
               <description>DMA Channel Primary-alternate Set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Control Structure Status / Select Alt Structure</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>31</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x7FFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ALTCLR</name>
               <addressOffset>0x00000034</addressOffset>
               <size>32</size>
               <description>DMA Channel Primary-alternate Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Select Primary Data Structure</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>31</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x7FFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRISET</name>
               <addressOffset>0x00000038</addressOffset>
               <size>32</size>
               <description>DMA Channel Priority Set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Configure Channel for High Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>31</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x7FFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRICLR</name>
               <addressOffset>0x0000003C</addressOffset>
               <size>32</size>
               <description>DMA Channel Priority Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHPRICLR</name>
                     <description>Configure Channel for Default Priority Level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>31</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x7FFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ERRCHNLCLR</name>
               <addressOffset>0x00000048</addressOffset>
               <size>32</size>
               <description>DMA per Channel Error Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Per Channel Bus Error Status/ Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>31</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x7FFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ERRCLR</name>
               <addressOffset>0x0000004C</addressOffset>
               <size>32</size>
               <description>DMA Bus Error Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Bus Error Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>31</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x7FFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>INVALIDDESCCLR</name>
               <addressOffset>0x00000050</addressOffset>
               <size>32</size>
               <description>DMA per Channel Invalid Descriptor Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Per Channel Invalid Descriptor Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>31</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x7FFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>BSSET</name>
               <addressOffset>0x00000800</addressOffset>
               <size>32</size>
               <description>DMA Channel Bytes Swap Enable Set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Byte Swap Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>31</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x7FFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>BSCLR</name>
               <addressOffset>0x00000804</addressOffset>
               <size>32</size>
               <description>DMA Channel Bytes Swap Enable Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Disable Byte Swap</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>31</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x7FFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
