cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
            <register>
               <name>SRCADDRSET</name>
               <addressOffset>0x00000810</addressOffset>
               <size>32</size>
               <description>DMA Channel Source Address Decrement Enable Set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Source Address Decrement Status / Configure</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>31</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x7FFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRCADDRCLR</name>
               <addressOffset>0x00000814</addressOffset>
               <size>32</size>
               <description>DMA Channel Source Address Decrement Enable Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Disable Source Address Decrement</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>31</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x7FFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSTADDRSET</name>
               <addressOffset>0x00000818</addressOffset>
               <size>32</size>
               <description>DMA Channel Destination Address Decrement Enable Set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Destination Address Decrement Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>31</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x7FFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSTADDRCLR</name>
               <addressOffset>0x0000081C</addressOffset>
               <size>32</size>
               <description>DMA Channel Destination Address Decrement Enable Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Disable Destination Address Decrement</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>31</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x7FFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>REVID</name>
               <addressOffset>0x00000FE0</addressOffset>
               <size>32</size>
               <description>DMA Controller Revision ID</description>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>DMAREVID</name>
                     <description>DMA Controller Revision ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>CACHE</name>
         <description>Cache Controller</description>
         <baseAddress>0x40044000</baseAddress>
         <groupName>CACHE</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>CACHE</name>
	    <value>85</value>
	    <description>CACHE</description>
	 </interrupt>
         <registers>
            <register>
               <name>STAT</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>Cache Status Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CCEN</name>
                     <description>Code Cache Enable Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CCLCK</name>
                     <description>Code Cache Lock Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CCWIPE</name>
                     <description>Code Cache Memory Wipe in Progress</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SETUP</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <description>Cache Setup Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CCEN</name>
                     <description>Code Cache Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>CCFLUSHDIS</name>
                     <description>Disable Automatic Cache and Buffer Flush on Any Flash Update</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEY</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <description>Cache Key Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>Cache Key Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PERFSETUP</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <description>Cache Performance Monitor Setup Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STOPCNTR</name>
                     <description>Performance Counter Stop</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>STRTCNTR</name>
                     <description>Performance Counter Start</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACCESSCNTR</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size>
               <description>Cache Miss Counter</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNT</name>
                     <description>Cache Internal Performance Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>MSTRSETUP</name>
               <addressOffset>0x00000024</addressOffset>
               <size>32</size>
               <description>Cache Master Setup Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MSTRNRA</name>
                     <description>No Read Allocate for Master</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECCSTAT</name>
               <addressOffset>0x00000034</addressOffset>
               <size>32</size>
               <description>Cache SRAM ECC Status Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ECCIntSta</name>
                     <description>Cache SRAM ECC Error Interrupt Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NoError</name>
                           <description>No Error</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error2bit</name>
                           <description>2 Bit Error</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error1bit</name>
                           <description>1 Bit Error</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error1or2bit</name>
                           <description>Either 1 Bit Error or 2 Bit Error</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECCHrespSta</name>
                     <description>Cache SRAM ECC Error Hresp Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NoError</name>
                           <description>No Error</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error2bit</name>
                           <description>2 Bit Error</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error1bit</name>
                           <description>1 Bit Error</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved</name>
                           <description>Reserved</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECCErrorCnt</name>
                     <description>Cache SRAM ECC Error Counter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECCADDR</name>
               <addressOffset>0x00000038</addressOffset>
               <size>32</size>
               <description>Cache SRAM ECC Address Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ECCAddr</name>
                     <description>Cache SRAM ECC Error Interrupt Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
