cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>FLASH</name>
         <description>Unknown</description>
         <baseAddress>0x40048000</baseAddress>
         <groupName>FLASH</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>FLASH</name>
	    <value>18</value>
	    <description>FLASH</description>
	 </interrupt>
         <registers>
            <register>
               <name>FEESTA</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>Status Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CMDBUSY</name>
                     <description>Command Busy.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WRCLOSE</name>
                     <description>Key-hole Registers Closed for Access</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CMDCOMP</name>
                     <description>Command Complete</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WRALCOMP</name>
                     <description>Write Almost Complete - Key-hole Registers Open for Access</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CMDFAIL</name>
                     <description>Command Failed</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SUCCESS</name>
                           <description>Successful Completion of a Command or a Write</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DENIED</name>
                           <description>Attempted Signcheck,write or Erase of a Protected Location or Out of Memory Location. the Command is Ignored.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VERIFYERR</name>
                           <description>Read Verify Error</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ABORTED</name>
                           <description>Indicates That a Command or a Write Was Aborted by an Abort Command or a System Interrupt Has Caused an Abort</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECCERRCMD</name>
                     <description>ECC Errors Produced During Signature Commands</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NoError</name>
                           <description>No Error, Successful Flash Read Operation During Signature Check</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error2bit</name>
                           <description>During Signature Commands, 2 Bit Error is Detected on One or More Flash Locations, Not Corrected.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error1bit</name>
                           <description>1 Bit Error is Corrected for One or More Flash Locations While Doing Signature Commands</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error1or2bit</name>
                           <description>During Signature Commands, 1 Bit Error and 2 Bit Errors are Detected on One or More Flash Locations</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECCREADERRFLSH0</name>
                     <description>ECC Interrupt Errors During AHB Read to Flash 0.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NoError</name>
                           <description>No Error. Successful Read from Program Flash via AHB Bus</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error2bit</name>
                           <description>During AHB Read to Flash, 2 Bit Error Detected, Not Corrected.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error1bit</name>
                           <description>1 Bit Error is Corrected for One Flash Location While Doing AHB Read to Program Flash</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error1or2bit</name>
                           <description>During AHB Read, It is Either ECC Error or ECC Corrected Error Only. but This Condition Can Occur If the Consecutive Access Had AHB HRESP Error Due to ECC Error, Before the Status Register is Read.</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECCREADERRFLSH1</name>
                     <description>ECC Interrupt Errors During AHB Read to Flash 1.</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NoError</name>
                           <description>No Error. Successful Read from Data Flash via AHB Bus</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error2bit</name>
                           <description>1 Bit Error is Corrected for One Flash Location While Doing AHB Read to Data Flash</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error1bit</name>
                           <description>During AHB Read to Flash, 2 Bit Error Detected, Not Corrected.</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error1or2bit</name>
                           <description>During AHB Read, It is Either ECC Error or ECC Corrected Error Only. but This Condition Can Occur If the Consecutive Access Had AHB HRESP Error Due to ECC Error, Before the Status Register is Read.</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIGNERR</name>
                     <description>Initial Signature Check Error on Info Space</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>INIT</name>
                     <description>Initialization Upload in Progress.</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ECCERRINITSIGN</name>
                     <description>ECC Error on Initial Info Signature Check</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NoError</name>
                           <description>No Error, Successful Flash Read Operation During Initial Signature Check, Page Signature Check</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error2bit</name>
                           <description>During Initial Signature Check, 2 Bit Error Detected, Not Corrected for at Least One Flash Location</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error1bit</name>
                           <description>1 Bit Error is Corrected for One Flash Location While Doing Signature Commands</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error1or2bit</name>
                           <description>During Initial Signature Command, 1 Bit Error and 2 Bit Errors are Detected on One or More Flash Locations</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECCERRCNTC0</name>
                     <description>ECC Error Count via CODE Bus of Flash 0</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ECCERRCNTD0</name>
                     <description>ECC Error Count via DMA Bus of Flash 0</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ECCERRCNTC1</name>
                     <description>ECC Error Count via CODE Bus of Flash 1</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ECCHRESPCODE</name>
                     <description>ECC Error Response on CODE Bus</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NoError</name>
                           <description>No Error. Successful Read from Program Flash via AHB Bus</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error2bit</name>
                           <description>During AHB Read to Flash, 2 Bit Error Detected, Not Corrected.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error1bit</name>
                           <description>1 Bit Error is Corrected for One Flash Location While Doing AHB Read to Program Flash</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved</name>
                           <description>Reserved</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECCHRESPDMA</name>
                     <description>ECC Error Response on DMA Bus</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NoError</name>
                           <description>No Error. Successful Read from Program Flash via AHB Bus</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error2bit</name>
                           <description>During AHB Read to Flash, 2 Bit Error Detected, Not Corrected.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error1bit</name>
                           <description>1 Bit Error is Corrected for One Flash Location While Doing AHB Read to Program Flash</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved</name>
                           <description>Reserved</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECCERRCNTD1</name>
                     <description>ECC Error Count via DMA Bus of Flash 1</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEECON0</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <description>Command Control Register - Interrupt Enable Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IENCMD</name>
                     <description>Command Complete Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IWRALCOMP</name>
                     <description>Write Almost Complete Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IENERR</name>
                     <description>Command Fail Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEECMD</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <description>Command Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CMD</name>
                     <description>Commands</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IDLE</name>
                           <description>IDLE</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERASEPAGE</name>
                           <description>ERASEPAGE</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SIGN</name>
                           <description>SIGN</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRITE</name>
                           <description>WRITE</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MASSERASE_ACTIVE</name>
                           <description>MASSERASE_ACTIVE</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MASSERASE_PASSIVE</name>
                           <description>MASSERASE_PASSIVE</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ABORT</name>
                           <description>ABORT</description>
                           <value>8</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEEFLADR</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <description>Flash Address Key - Hole Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLAddr</name>
                     <description>Memory Mapped Address for the Flash Location</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>18</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0003FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEEFLDATA0</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size>
               <description>Flash Data Register - Key - Hole Interface Lower 32 Bits</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLData0</name>
                     <description>Lower 32 Bit of 64 Bit Data to Be Written to Flash</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEEFLDATA1</name>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size>
               <description>Flash Data Register - Key - Hole Interface Upper 32 Bits</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLData1</name>
                     <description>Upper 32 Bit of 64 Bit Data to Be Written to Flash</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
