cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
            <register>
               <name>FEEADR0</name>
               <addressOffset>0x00000018</addressOffset>
               <size>32</size>
               <description>Lower Page Address</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PageAddr0</name>
                     <description>Page Address 0</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEEADR1</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>32</size>
               <description>Upper Page Address</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PageAddr1</name>
                     <description>Page Address 1</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEEKEY</name>
               <addressOffset>0x00000020</addressOffset>
               <size>32</size>
               <description>Flash Key Register.</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>Key Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEEPRO0</name>
               <addressOffset>0x00000028</addressOffset>
               <size>32</size>
               <description>Write Protection Register for Flash0</description>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>WrProt0</name>
                     <description>Write Protection for Flash0 - 32 Bits.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEEPRO1</name>
               <addressOffset>0x0000002C</addressOffset>
               <size>32</size>
               <description>Write Protection Register for Flash1</description>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>WrProt1</name>
                     <description>Write Protection for Flash1 - 32 Bits.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEESIG</name>
               <addressOffset>0x00000034</addressOffset>
               <size>32</size>
               <description>Flash Signature</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>Sign</name>
                     <description>Signature</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEECON1</name>
               <addressOffset>0x00000038</addressOffset>
               <size>32</size>
               <description>User Setup Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JtagDebugEn</name>
                     <description>JTAG Debug Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>KHDMAEn</name>
                     <description>Key - Hole DMA Enable.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>AutoIncrEn</name>
                     <description>Auto Address Increment for Key Hole Access.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SwapProgramCode</name>
                     <description>Swap Program Code for MDIO Mode.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MDIOmode</name>
                     <description>MDIO Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SwapFlash0</name>
                     <description>Swap Top and Bottom Image Inside Flash 0.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SwapFlash1</name>
                     <description>Swap Top and Bottom Image Inside Flash 1.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SwapInFlashEn</name>
                     <description>Swap Inside Flash Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEEWRADDRA</name>
               <addressOffset>0x00000040</addressOffset>
               <size>32</size>
               <description>Write Abort Address Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WrAbortAddr</name>
                     <description>Write Abort Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEEAEN0</name>
               <addressOffset>0x00000048</addressOffset>
               <size>32</size>
               <description>Lower 32 Bits of the Sys Irq Abort Enable Register.</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SysIrqAbortEn</name>
                     <description>Lower 32 Bits of System Interrupt Abort Enable.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEEAEN1</name>
               <addressOffset>0x0000004C</addressOffset>
               <size>32</size>
               <description>Middle 32 Bits of the Sys Irq Abort Enable Register.</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SysIrqAbortEn</name>
                     <description>Middle 32 Bits of System Interrupt Abort Enable.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEEAEN2</name>
               <addressOffset>0x00000050</addressOffset>
               <size>32</size>
               <description>Upper 32 Bits of the Sys Irq Abort Enable Register.</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SysIrqAbortEn</name>
                     <description>Upper 32 Bits of System Interrupt Abort Enable.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEEECCCONFIG</name>
               <addressOffset>0x00000064</addressOffset>
               <size>32</size>
               <description>Configurable ECC Enable/disable, Error Response</description>
               <resetValue>0x00000012</resetValue>
               <fields>
                  <field>
                     <name>ECCDisable</name>
                     <description>ECC Disable Bit.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>ECCAHBERROR</name>
                     <description>Signifies How to Generate AHB Error on ECC</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NoError</name>
                           <description>AHB Error (HRESP = 1) is Not Generated Even If There is an ECC Error While Reading from Flash via AHB. This Applies to Both Flash.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error2bit</name>
                           <description>AHB Error (HRESP = 1) is Generated Only If 2 Bit Error is Detected During AHB Read to Flash 0 or 1.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error1bit</name>
                           <description>AHB Error (HRESP = 1) is Generated Only If 1 Bit Error Corrected During AHB Read to Flash 0 or 1</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error1or2bit</name>
                           <description>AHB Error (HRESP = 1) is Generated If Either 2 Bit Detected or 1 Bit Error Corrected During AHB Read to Flash 0 or 1</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECCIntrERROR</name>
                     <description>Interrupt Enable When a ECC Error Happens During an AHB Read</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>Disable</name>
                           <description>Interrupt is Not Generated Even If There is an ECC Error While Reading from Flash via AHB. This Applies to Both Flash.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error2bitEn</name>
                           <description>Interrupt is Generated Only If 2 Bit Error is Detected During AHB Read to Flash 0 or 1.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error1bitEn</name>
                           <description>Interrupt is Generated Only If 1 Bit Error Corrected During AHB Read to Flash 0 or 1.</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Error1or2bitEn</name>
                           <description>Interrupt is Generated If Either 2 Bit Detected or 1 Bit Error Corrected During AHB Read to Flash 0 or 1.</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECCAddrCon</name>
                     <description>ECC Error Address Control Bit.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NBufNClr</name>
                           <description>ECC Error Address Register Can&#39;t Be Cleared Until Reset; Current ECC Error Address Will Be Returned Directly When Reading ECC_ADDR MMR.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BufNClr</name>
                           <description>ECC Error Address Register Can&#39;t Be Cleared Until Reset; ECC Error Address is Latched on Read of STATUS MMR, and It Will Be Returned When Reading ECC_ADDR MMR.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BufClr2</name>
                           <description>Previous ECC Error Address Register is Cleared on Read of STATUS MMR; ECC Error Address is Latched on Read of STATUS MMR, and It Will Be Returned When Reading ECC_ADDR MMR.</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BufClr3</name>
                           <description>Previous ECC Error Address Register is Cleared on Read of STATUS MMR; ECC Error Address is Latched on Read of STATUS MMR, and It Will Be Returned When Reading ECC_ADDR MMR.</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEEECCADDRC0</name>
               <addressOffset>0x00000074</addressOffset>
               <size>32</size>
               <description>Flash 0 ECC Error Address via CODE Bus</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLECCAddrC0</name>
                     <description>Flash0 Address for Which ECC Error is Detected via CODE Bus.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>21</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEEECCADDRC1</name>
               <addressOffset>0x00000078</addressOffset>
               <size>32</size>
               <description>Flash 1 ECC Error Address via CODE Bus</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLECCAddrC1</name>
                     <description>Flash1 Address for Which ECC Error is Detected via CODE Bus.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>21</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEEECCADDRD0</name>
               <addressOffset>0x00000094</addressOffset>
               <size>32</size>
               <description>Flash 0 ECC Error Address via DMA Bus</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLECCAddrD0</name>
                     <description>Flash0 Address for Which ECC Error is Detected via DMA Bus.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>21</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEEECCADDRD1</name>
               <addressOffset>0x00000098</addressOffset>
               <size>32</size>
               <description>Flash 1 ECC Error Address via DMA Bus</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLECCAddrD1</name>
                     <description>Flash1 Address for Which ECC Error is Detected via DMA Bus.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>21</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
