cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>GPIO</name>
         <description>Unknown</description>
         <baseAddress>0x40050000</baseAddress>
         <groupName>GPIO</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00001000</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>GPIO_INTA</name>
	    <value>87</value>
	    <description>GPIO_INTA</description>
	 </interrupt>
	 <interrupt>
	    <name>GPIO_INTB</name>
	    <value>88</value>
	    <description>GPIO_INTB</description>
	 </interrupt>
         <registers>
            <register>
               <name>GP0CON</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size> 
               <description>GPIO Port 0 Configuration</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CON0</name>
                     <description>P0.0 Configuration Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCLK0</name>
                           <description>SPI0 SCLK</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COMOUT0</name>
                           <description>Comparater Output</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAI0</name>
                           <description>PLAI[0]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON1</name>
                     <description>P0.1 Configuration Bits</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MISO0</name>
                           <description>SPI0 MISO</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COMOUT1</name>
                           <description>Comparater Output</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAI1</name>
                           <description>PLAI[1]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON2</name>
                     <description>P0.2 Configuration Bits</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MOSI0</name>
                           <description>SPI0 MOSI</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLACLK1</name>
                           <description>PLA Clock 1</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAI2</name>
                           <description>PLAI[2]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON3</name>
                     <description>P0.3 Configuration Bits</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIOIRQ0</name>
                           <description>GPIO/IRQ0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CS0</name>
                           <description>SPI0 CS</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLACLK0</name>
                           <description>PLA CLK0</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAI3</name>
                           <description>PLAI[3]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON4</name>
                     <description>P0.4 Configuration Bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCL0</name>
                           <description>I2C0 SCL</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SIN0</name>
                           <description>UART0 SIN</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAO2</name>
                           <description>PLAO[2]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON5</name>
                     <description>P0.5 Configuration Bits</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SDA0</name>
                           <description>I2C0 SDA</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SOUT0</name>
                           <description>UART0 SOUT</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAO3</name>
                           <description>PLAO[3]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON6</name>
                     <description>P0.6 Configuration Bits</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCL2</name>
                           <description>I2C2 SCL</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COMPDIN0</name>
                           <description>Comparator Data Input 0</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAO4</name>
                           <description>PLAO[4]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON7</name>
                     <description>P0.7 Configuration Bits</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SDA2</name>
                           <description>I2C2 SDA</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COMPDIN1</name>
                           <description>Comparator Data Input 1</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAO5</name>
                           <description>PLAO[5]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP0OE</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size> 
               <description>GPIO Port 0 Output Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OE</name>
                     <description>Open Drain Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP0IE</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size> 
               <description>GPIO Port 0 Input Path Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IE</name>
                     <description>Input Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP0IN</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size> 
               <description>GPIO Port 0 Registered Data Input</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>Y</name>
                     <description>Data Input from Pad</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP0OUT</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size> 
               <description>GPIO Port 0 Data Output</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>A</name>
                     <description>Data Output to Pad</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP0SET</name>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size> 
               <description>GPIO Port 0 Data Out Set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SETUP</name>
                     <description>Set the Output HIGH for the Pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP0CLR</name>
               <addressOffset>0x00000018</addressOffset>
               <size>32</size> 
               <description>GPIO Port 0 Data Out Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLR</name>
                     <description>Set the Output Low for the Port Pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP0TGL</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>32</size> 
               <description>GPIO Port 0 Pin Toggle</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TGL</name>
                     <description>Toggle the Output of the Port Pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP0ODE</name>
               <addressOffset>0x00000020</addressOffset>
               <size>32</size> 
               <description>GPIO Port 0 Open Drain Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ODE</name>
                     <description>Open Drain Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP0IS</name>
               <addressOffset>0x00000024</addressOffset>
               <size>32</size> 
               <description>GPIO Port 0 Input Select</description>
               <resetValue>0x000000FF</resetValue>
               <fields>
                  <field>
                     <name>ISEL</name>
                     <description>Input Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP0PE</name>
               <addressOffset>0x00000028</addressOffset>
               <size>32</size> 
               <description>GPIO Port 0 Pull Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PE</name>
                     <description>Pull Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP0PS</name>
               <addressOffset>0x0000002C</addressOffset>
               <size>32</size> 
               <description>GPIO Port 0 Pull Select</description>
               <resetValue>0x000000FF</resetValue>
               <fields>
                  <field>
                     <name>PS</name>
                     <description>Pull Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP0SR</name>
               <addressOffset>0x00000030</addressOffset>
               <size>32</size> 
               <description>GPIO Port 0 Slew Rate</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SR</name>
                     <description>Slew Rate</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
