cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
            <register>
               <name>GP1CON</name>
               <addressOffset>0x00000050</addressOffset>
               <size>32</size> 
               <description>GPIO Port 1 Configuration</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CON0</name>
                     <description>P1.0 Configuration Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SIN1</name>
                           <description>UART1 SIN</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COMPOUT2</name>
                           <description>Comparater Output 2</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAI4</name>
                           <description>PLAI[4]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON1</name>
                     <description>P1.1 Configuration Bits</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SOUT1</name>
                           <description>UART 1 SOUT</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COMDOUT3</name>
                           <description>Comparater Output 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAI5</name>
                           <description>PLAI[5]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON2</name>
                     <description>P1.2 Configuration Bits</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCL1</name>
                           <description>I2C1 SCL</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PWM0</name>
                           <description>PWM</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAI6</name>
                           <description>PLAI6]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON3</name>
                     <description>P1.3 Configuration Bits</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SDA1</name>
                           <description>I2C1 SDA</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PWM1</name>
                           <description>PWM1</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAI7</name>
                           <description>PLAI[7]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON4</name>
                     <description>P1.4 Configuration Bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCLK1</name>
                           <description>SPI1 SCLK</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PWM2</name>
                           <description>PWM2</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAO10</name>
                           <description>PLAO[10]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON5</name>
                     <description>P1.5 Configuration Bits</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MISO1</name>
                           <description>SPI1 MISO</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PWM3</name>
                           <description>PWM3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAO11</name>
                           <description>PLAO[11]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON6</name>
                     <description>P1.6 Configuration Bits</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MOSI1</name>
                           <description>SPI1 MOSI</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PWM4</name>
                           <description>PWM4</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAO12</name>
                           <description>PLAO[12]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON7</name>
                     <description>P1.7 Configuration Bits</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO/IRQ1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CS1</name>
                           <description>SPI1 CS</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PWM5</name>
                           <description>PWM5</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAO13</name>
                           <description>PLAO[13]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP1OE</name>
               <addressOffset>0x00000054</addressOffset>
               <size>32</size> 
               <description>GPIO Port 1 Output Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OE</name>
                     <description>Output Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP1IE</name>
               <addressOffset>0x00000058</addressOffset>
               <size>32</size> 
               <description>GPIO Port 1 Input Path Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IE</name>
                     <description>Input Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP1IN</name>
               <addressOffset>0x0000005C</addressOffset>
               <size>32</size> 
               <description>GPIO Port 1 Registered Data Input</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>Y</name>
                     <description>Data Input from Pad</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP1OUT</name>
               <addressOffset>0x00000060</addressOffset>
               <size>32</size> 
               <description>GPIO Port 1 Data Output</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>A</name>
                     <description>Data Output to Pad</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP1SET</name>
               <addressOffset>0x00000064</addressOffset>
               <size>32</size> 
               <description>GPIO Port 1 Data Out Set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SETUP</name>
                     <description>Set the Output HIGH for the Pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP1CLR</name>
               <addressOffset>0x00000068</addressOffset>
               <size>32</size> 
               <description>GPIO Port 1 Data Out Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLR</name>
                     <description>Set the Output Low for the Port Pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP1TGL</name>
               <addressOffset>0x0000006C</addressOffset>
               <size>32</size> 
               <description>GPIO Port 1 Pin Toggle</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TGL</name>
                     <description>Toggle the Output of the Port Pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP1ODE</name>
               <addressOffset>0x00000070</addressOffset>
               <size>32</size> 
               <description>GPIO Port 1 Open Drain Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ODE</name>
                     <description>Open Drain Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP1IS</name>
               <addressOffset>0x00000074</addressOffset>
               <size>32</size> 
               <description>GPIO Port 1 Input Select</description>
               <resetValue>0x000000FF</resetValue>
               <fields>
                  <field>
                     <name>ISEL</name>
                     <description>Input Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP1PE</name>
               <addressOffset>0x00000078</addressOffset>
               <size>32</size> 
               <description>GPIO Port 1 Pull Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PE</name>
                     <description>Pull Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP1PS</name>
               <addressOffset>0x0000007C</addressOffset>
               <size>32</size> 
               <description>GPIO Port 1 Pull Select</description>
               <resetValue>0x000000FF</resetValue>
               <fields>
                  <field>
                     <name>PS</name>
                     <description>Pull Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP1SR</name>
               <addressOffset>0x00000080</addressOffset>
               <size>32</size> 
               <description>GPIO Port 1 Slew Rate</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SR</name>
                     <description>Slew Rate</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
