cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
            <register>
               <name>GP2CON</name>
               <addressOffset>0x000000A0</addressOffset>
               <size>32</size> 
               <description>GPIO Port 2 Configuration</description>
               <resetValue>0x00000010</resetValue>
               <fields>
                  <field>
                     <name>CON0</name>
                     <description>P2.0 Configuration Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADCCONV</name>
                           <description>ADC Convert</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COMDIN2</name>
                           <description>Comparator Data Input 2</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAI8</name>
                           <description>PLA GPIO Input[8]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON1</name>
                     <description>P2.1 Configuration Bits</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIOIRQ2</name>
                           <description>GPIO/IRQ2</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ECLKIN</name>
                           <description>External Clock in</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COMPDIN3</name>
                           <description>Comparater Data Input</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAI9</name>
                           <description>PLAI[9]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON2</name>
                     <description>P2.2 Configuration Bits</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POR</name>
                           <description>Power Reset</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLKOUT</name>
                           <description>Clock Output</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SWO</name>
                           <description>Serial Wire Output</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON3</name>
                     <description>P2.3 Configuration Bits</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIOBM</name>
                           <description>GPIO/BM</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAI10</name>
                           <description>PLAI[10]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON4</name>
                     <description>P2.4 Configuration Bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GIPO</name>
                           <description>GPIO/IRQ4</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MOSI2</name>
                           <description>SPI2 MOSI</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SIN1</name>
                           <description>UART1 RX of ITLA package</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAO18</name>
                           <description>PLAO[18]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON5</name>
                     <description>P2.5 Configuration Bits</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MISO2</name>
                           <description>Spi2 Miso</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SOUT1</name>
                           <description>UART1 TX of ITLA package</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAO19</name>
                           <description>PLAO[19]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON6</name>
                     <description>P2.6 Configuration Bits</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIOIRQ5</name>
                           <description>GPIO/IRQ5</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCLK2</name>
                           <description>SPI 2 SCLK</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCL1</name>
                           <description>I2C1 SCL of ITLA Package</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAO20</name>
                           <description>PLAO[20]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON7</name>
                     <description>P2.7 Configuration Bits</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIOIRQ6</name>
                           <description>GPIO/IRQ6</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CS2</name>
                           <description>SPI 2 CS</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SDA1</name>
                           <description>I2C1 SDA of ITLA package</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAO21</name>
                           <description>PLAO[21]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP2OE</name>
               <addressOffset>0x000000A4</addressOffset>
               <size>32</size> 
               <description>GPIO Port 2 Output Enable</description>
               <resetValue>0x00000004</resetValue>
               <fields>
                  <field>
                     <name>OE</name>
                     <description>Output Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP2IE</name>
               <addressOffset>0x000000A8</addressOffset>
               <size>32</size> 
               <description>GPIO Port 2 Input Path Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IE</name>
                     <description>Input Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP2IN</name>
               <addressOffset>0x000000AC</addressOffset>
               <size>32</size> 
               <description>GPIO Port 2 Registered Data Input</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>Y</name>
                     <description>Data Input from Pad</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP2OUT</name>
               <addressOffset>0x000000B0</addressOffset>
               <size>32</size> 
               <description>GPIO Port 2 Data Output</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>A</name>
                     <description>Data Output to Pad</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP2SET</name>
               <addressOffset>0x000000B4</addressOffset>
               <size>32</size> 
               <description>GPIO Port 2 Data Out Set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SETUP</name>
                     <description>Set the Output HIGH for the Pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP2CLR</name>
               <addressOffset>0x000000B8</addressOffset>
               <size>32</size> 
               <description>GPIO Port 2 Data Out Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLR</name>
                     <description>Set the Output Low for the Port Pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP2TGL</name>
               <addressOffset>0x000000BC</addressOffset>
               <size>32</size> 
               <description>GPIO Port 2 Pin Toggle</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TGL</name>
                     <description>Toggle the Output of the Port Pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP2ODE</name>
               <addressOffset>0x000000C0</addressOffset>
               <size>32</size> 
               <description>GPIO Port 2 Open Drain Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ODE</name>
                     <description>Open Drain Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP2IS</name>
               <addressOffset>0x000000C4</addressOffset>
               <size>32</size> 
               <description>GPIO Port 2 Input Select</description>
               <resetValue>0x000000FF</resetValue>
               <fields>
                  <field>
                     <name>ISEL</name>
                     <description>Input Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP2PE</name>
               <addressOffset>0x000000C8</addressOffset>
               <size>32</size> 
               <description>GPIO Port 2 Pull Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PE</name>
                     <description>Pull Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP2PS</name>
               <addressOffset>0x000000CC</addressOffset>
               <size>32</size> 
               <description>GPIO Port 2 Pull Select</description>
               <resetValue>0x000000FF</resetValue>
               <fields>
                  <field>
                     <name>PS</name>
                     <description>Pull Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP2SR</name>
               <addressOffset>0x000000D0</addressOffset>
               <size>32</size> 
               <description>GPIO Port 2 Slew Rate</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SR</name>
                     <description>Slew Rate</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
