cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
            <register>
               <name>GP2DS</name>
               <addressOffset>0x000000D4</addressOffset>
               <size>32</size> 
               <description>GPIO Port 2 Drive Select</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DS0</name>
                     <description>Drive Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STRENGTH1</name>
                           <description>Drive Strength 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH2</name>
                           <description>Drive Strength 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH3</name>
                           <description>Drive Strength 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH4</name>
                           <description>Drive Strength 4</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DS1</name>
                     <description>Drive Select</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STRENGTH1</name>
                           <description>Drive Strength 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH2</name>
                           <description>Drive Strength 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH3</name>
                           <description>Drive Strength 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH4</name>
                           <description>Drive Strength 4</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DS2</name>
                     <description>Drive Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STRENGTH1</name>
                           <description>Drive Strength 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH2</name>
                           <description>Drive Strength 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH3</name>
                           <description>Drive Strength 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH4</name>
                           <description>Drive Strength 4</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DS3</name>
                     <description>Drive Select</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STRENGTH1</name>
                           <description>Drive Strength 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH2</name>
                           <description>Drive Strength 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH3</name>
                           <description>Drive Strength 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH4</name>
                           <description>Drive Strength 4</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DS4</name>
                     <description>Drive Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STRENGTH1</name>
                           <description>Drive Strength 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH2</name>
                           <description>Drive Strength 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH3</name>
                           <description>Drive Strength 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH4</name>
                           <description>Drive Strength 4</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DS5</name>
                     <description>Drive Select</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STRENGTH1</name>
                           <description>Drive Strength 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH2</name>
                           <description>Drive Strength 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH3</name>
                           <description>Drive Strength 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH4</name>
                           <description>Drive Strength 4</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DS6</name>
                     <description>Drive Select</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STRENGTH1</name>
                           <description>Drive Strength 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH2</name>
                           <description>Drive Strength 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH3</name>
                           <description>Drive Strength 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH4</name>
                           <description>Drive Strength 4</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DS7</name>
                     <description>Drive Select</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STRENGTH1</name>
                           <description>Drive Strength 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH2</name>
                           <description>Drive Strength 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH3</name>
                           <description>Drive Strength 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH4</name>
                           <description>Drive Strength 4</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP2POL</name>
               <addressOffset>0x000000DC</addressOffset>
               <size>32</size> 
               <description>Interrupt Polarity</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INTPOL</name>
                     <description>Interrupt Polarity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP2IENA</name>
               <addressOffset>0x000000E0</addressOffset>
               <size>32</size> 
               <description>InterruptA Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INTAEN</name>
                     <description>InterruptA Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP2IENB</name>
               <addressOffset>0x000000E4</addressOffset>
               <size>32</size> 
               <description>InterruptB Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INTBEN</name>
                     <description>InterruptB Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP2INT</name>
               <addressOffset>0x000000E8</addressOffset>
               <size>32</size> 
               <description>Interrupt Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INTSTATUS</name>
                     <description>Interrupt Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
