cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
            <register>
               <name>GP3CON</name>
               <addressOffset>0x000000F0</addressOffset>
               <size>32</size> 
               <description>GPIO Port 3 Configuration</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CON0</name>
                     <description>P3.0 Configuration Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO/IRQ8</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PRTADDR0</name>
                           <description>MDIO Port Address 0</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRDY0</name>
                           <description>SPI 0 Sready</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAI12</name>
                           <description>PLAI[12]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON1</name>
                     <description>P3.1 Configuration Bits</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PRTADDR1</name>
                           <description>MDIO PRTADDR1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PWMSYNC</name>
                           <description>PWM Sync</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAI13</name>
                           <description>PLAI[13]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON2</name>
                     <description>P3.2 Configuration Bits</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PRTADD2</name>
                           <description>MDIO Port Address2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PWMTRIP</name>
                           <description>PWM Trip</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAI14</name>
                           <description>PLAI[14]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON3</name>
                     <description>P3.3 Configuration Bits</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PRTADDR3</name>
                           <description>MDIO Port Address3</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SIN0</name>
                           <description>Duplicate SIN0</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAI15</name>
                           <description>PLAI[15]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON4</name>
                     <description>P3.4 Configuration Bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIOIRQ9</name>
                           <description>GPIO/IRQ9</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PRTADDR4</name>
                           <description>MDIO Port Address 4</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SOUT0</name>
                           <description>Duplicate SOUT0</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAO26</name>
                           <description>PLAO[26]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON5</name>
                     <description>P3.5 Configuration Bits</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MCK</name>
                           <description>SLVA MDIO MCK</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRDY1</name>
                           <description>SPI 1 Sready</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAO27</name>
                           <description>PLAO[27]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON6</name>
                     <description>P3.6 Configuration Bits</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MDIO</name>
                           <description>SLAVE MDIO MDIO</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRDY2</name>
                           <description>SPI 2 Sready</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAO30</name>
                           <description>PLA Output 30</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON7</name>
                     <description>P3.7 Configuration Bits</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAO29</name>
                           <description>PLAO[29]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP3OE</name>
               <addressOffset>0x000000F4</addressOffset>
               <size>32</size> 
               <description>GPIO Port 3 Output Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OE</name>
                     <description>Output Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP3IE</name>
               <addressOffset>0x000000F8</addressOffset>
               <size>32</size> 
               <description>GPIO Port 3 Input Path Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IE</name>
                     <description>Input Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP3IN</name>
               <addressOffset>0x000000FC</addressOffset>
               <size>32</size> 
               <description>GPIO Port 3 Registered Data Input</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>Y</name>
                     <description>Data Input from Pad</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP3OUT</name>
               <addressOffset>0x00000100</addressOffset>
               <size>32</size> 
               <description>GPIO Port 3 Data Output</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>A</name>
                     <description>Data Output to Pad</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP3SET</name>
               <addressOffset>0x00000104</addressOffset>
               <size>32</size> 
               <description>GPIO Port 3 Data Out Set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SETUP</name>
                     <description>Set the Output HIGH for the Pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP3CLR</name>
               <addressOffset>0x00000108</addressOffset>
               <size>32</size> 
               <description>GPIO Port 3 Data Out Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLR</name>
                     <description>Set the Output Low for the Port Pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP3TGL</name>
               <addressOffset>0x0000010C</addressOffset>
               <size>32</size> 
               <description>GPIO Port 3 Pin Toggle</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TGL</name>
                     <description>Toggle the Output of the Port Pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP3ODE</name>
               <addressOffset>0x00000110</addressOffset>
               <size>32</size> 
               <description>GPIO Port 3 Open Drain Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ODE</name>
                     <description>Open Drain Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP3IS</name>
               <addressOffset>0x00000114</addressOffset>
               <size>32</size> 
               <description>GPIO Port 3 Input Select</description>
               <resetValue>0x000000FF</resetValue>
               <fields>
                  <field>
                     <name>ISEL</name>
                     <description>Input Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP3PE</name>
               <addressOffset>0x00000118</addressOffset>
               <size>32</size> 
               <description>GPIO Port 3 Pull Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PE</name>
                     <description>Pull Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP3PS</name>
               <addressOffset>0x0000011C</addressOffset>
               <size>32</size> 
               <description>GPIO Port 3 Pull Select</description>
               <resetValue>0x000000FF</resetValue>
               <fields>
                  <field>
                     <name>PS</name>
                     <description>Pull Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP3SR</name>
               <addressOffset>0x00000120</addressOffset>
               <size>32</size> 
               <description>GPIO Port 3 Slew Rate</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SR</name>
                     <description>Slew Rate</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
