cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
            <register>
               <name>GP3DS</name>
               <addressOffset>0x00000124</addressOffset>
               <size>32</size> 
               <description>GPIO Port 3 Drive Select</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DS0</name>
                     <description>Drive Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STRENGTH1</name>
                           <description>Drive Strength 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH2</name>
                           <description>Drive Strength 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH3</name>
                           <description>Drive Strength 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH4</name>
                           <description>Drive Strength 4</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DS1</name>
                     <description>Drive Select</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STRENGTH1</name>
                           <description>Drive Strength 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH2</name>
                           <description>Drive Strength 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH3</name>
                           <description>Drive Strength 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH4</name>
                           <description>Drive Strength 4</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DS2</name>
                     <description>Drive Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STRENGTH1</name>
                           <description>Drive Strength 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH2</name>
                           <description>Drive Strength 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH3</name>
                           <description>Drive Strength 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH4</name>
                           <description>Drive Strength 4</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DS3</name>
                     <description>Drive Select</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STRENGTH1</name>
                           <description>Drive Strength 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH2</name>
                           <description>Drive Strength 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH3</name>
                           <description>Drive Strength 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH4</name>
                           <description>Drive Strength 4</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DS4</name>
                     <description>Drive Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STRENGTH1</name>
                           <description>Drive Strength 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH2</name>
                           <description>Drive Strength 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH3</name>
                           <description>Drive Strength 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH4</name>
                           <description>Drive Strength 4</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DS5</name>
                     <description>Drive Select</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STRENGTH1</name>
                           <description>Drive Strength 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH2</name>
                           <description>Drive Strength 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH3</name>
                           <description>Drive Strength 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH4</name>
                           <description>Drive Strength 4</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DS6</name>
                     <description>Drive Select</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STRENGTH1</name>
                           <description>Drive Strength 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH2</name>
                           <description>Drive Strength 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH3</name>
                           <description>Drive Strength 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH4</name>
                           <description>Drive Strength 4</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DS7</name>
                     <description>Drive Select</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STRENGTH1</name>
                           <description>Drive Strength 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH2</name>
                           <description>Drive Strength 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH3</name>
                           <description>Drive Strength 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH4</name>
                           <description>Drive Strength 4</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP3POL</name>
               <addressOffset>0x0000012C</addressOffset>
               <size>32</size> 
               <description>GPIO Interrupt Polarity Select</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INTPOL</name>
                     <description>Parametric Output</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP3IENA</name>
               <addressOffset>0x00000130</addressOffset>
               <size>32</size> 
               <description>InterruptA Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INTAEN</name>
                     <description>InterruptA Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP3IENB</name>
               <addressOffset>0x00000134</addressOffset>
               <size>32</size> 
               <description>InterruptB Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INTBEN</name>
                     <description>InterruptB Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP3INT</name>
               <addressOffset>0x00000138</addressOffset>
               <size>32</size> 
               <description>Interrupt Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INTSTATUS</name>
                     <description>Interrupt Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP4CON</name>
               <addressOffset>0x00000140</addressOffset>
               <size>32</size> 
               <description>GPIO Port 4 Configuration</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CON0</name>
                     <description>P4.0 Configuration Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VDAC3</name>
                           <description>VDAC3</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAI11</name>
                           <description>PLAI[11]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON1</name>
                     <description>P4.1 Configuration Bits</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VDAC6</name>
                           <description>VDAC6</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLAO28</name>
                           <description>PLAO[28]</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON2</name>
                     <description>P4.2 Configuration Bits</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VDAC7</name>
                           <description>VDAC7</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON3</name>
                     <description>P4.3 Configuration Bits</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON4</name>
                     <description>P4.4 Configuration Bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VDAC5</name>
                           <description>VDAC5</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON5</name>
                     <description>P4.5 Configuration Bits</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON7</name>
                     <description>P4.7 Configuration Bits</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIOIRQ7</name>
                           <description>GPIO/IRQ7</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLACLK2</name>
                           <description>PLA Clock 2</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP4OE</name>
               <addressOffset>0x00000144</addressOffset>
               <size>32</size> 
               <description>GPIO Port 4 Output Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OE</name>
                     <description>Output Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP4IE</name>
               <addressOffset>0x00000148</addressOffset>
               <size>32</size> 
               <description>GPIO Port 4 Input Path Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IE</name>
                     <description>Input Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
