cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
            <register>
               <name>GP4IN</name>
               <addressOffset>0x0000014C</addressOffset>
               <size>32</size> 
               <description>GPIO Port 4 Registered Data Input</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>Y</name>
                     <description>Data Input from Pad</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP4OUT</name>
               <addressOffset>0x00000150</addressOffset>
               <size>32</size> 
               <description>GPIO Port 4 Data Output</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>A</name>
                     <description>Data Output to Pad</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP4SET</name>
               <addressOffset>0x00000154</addressOffset>
               <size>32</size> 
               <description>GPIO Port 4 Data Out Set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SETUP</name>
                     <description>Set the Output HIGH for the Pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP4CLR</name>
               <addressOffset>0x00000158</addressOffset>
               <size>32</size> 
               <description>GPIO Port 4 Data Out Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLR</name>
                     <description>Set the Output Low for the Port Pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP4TGL</name>
               <addressOffset>0x0000015C</addressOffset>
               <size>32</size> 
               <description>GPIO Port 4 Pin Toggle</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TGL</name>
                     <description>Toggle the Output of the Port Pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP4ODE</name>
               <addressOffset>0x00000160</addressOffset>
               <size>32</size> 
               <description>GPIO Port 4 Open Drain Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ODE</name>
                     <description>Open Drain Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP4IS</name>
               <addressOffset>0x00000164</addressOffset>
               <size>32</size> 
               <description>GPIO Port 4 Input Select</description>
               <resetValue>0x000000FF</resetValue>
               <fields>
                  <field>
                     <name>ISEL</name>
                     <description>Input Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP4PE</name>
               <addressOffset>0x00000168</addressOffset>
               <size>32</size> 
               <description>GPIO Port 4 Pull Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PE</name>
                     <description>Pull Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP4PS</name>
               <addressOffset>0x0000016C</addressOffset>
               <size>32</size> 
               <description>GPIO Port 4 Pull Select</description>
               <resetValue>0x000000FF</resetValue>
               <fields>
                  <field>
                     <name>PS</name>
                     <description>Pull Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP4SR</name>
               <addressOffset>0x00000170</addressOffset>
               <size>32</size> 
               <description>GPIO Port 4 Slew Rate</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SR</name>
                     <description>Slew Rate</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP4DS</name>
               <addressOffset>0x00000174</addressOffset>
               <size>32</size> 
               <description>GPIO Port 4 Drive Select</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DS0</name>
                     <description>Drive Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STRENGTH1</name>
                           <description>Drive Strength 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH2</name>
                           <description>Drive Strength 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH3</name>
                           <description>Drive Strength 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH4</name>
                           <description>Drive Strength 4</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DS1</name>
                     <description>Drive Select</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STRENGTH1</name>
                           <description>Drive Strength 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH2</name>
                           <description>Drive Strength 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH3</name>
                           <description>Drive Strength 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH4</name>
                           <description>Drive Strength 4</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DS2</name>
                     <description>Drive Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STRENGTH1</name>
                           <description>Drive Strength 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH2</name>
                           <description>Drive Strength 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH3</name>
                           <description>Drive Strength 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH4</name>
                           <description>Drive Strength 4</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DS3</name>
                     <description>Drive Select</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STRENGTH1</name>
                           <description>Drive Strength 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH2</name>
                           <description>Drive Strength 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH3</name>
                           <description>Drive Strength 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH4</name>
                           <description>Drive Strength 4</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DS4</name>
                     <description>Drive Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STRENGTH1</name>
                           <description>Drive Strength 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH2</name>
                           <description>Drive Strength 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH3</name>
                           <description>Drive Strength 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH4</name>
                           <description>Drive Strength 4</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DS5</name>
                     <description>Drive Select</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STRENGTH1</name>
                           <description>Drive Strength 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH2</name>
                           <description>Drive Strength 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH3</name>
                           <description>Drive Strength 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH4</name>
                           <description>Drive Strength 4</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DS6</name>
                     <description>Drive Select</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STRENGTH1</name>
                           <description>Drive Strength 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH2</name>
                           <description>Drive Strength 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH3</name>
                           <description>Drive Strength 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH4</name>
                           <description>Drive Strength 4</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DS7</name>
                     <description>Drive Select</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STRENGTH1</name>
                           <description>Drive Strength 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH2</name>
                           <description>Drive Strength 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH3</name>
                           <description>Drive Strength 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRENGTH4</name>
                           <description>Drive Strength 4</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP4POL</name>
               <addressOffset>0x0000017C</addressOffset>
               <size>32</size> 
               <description>GPIO Interrupt Polarity Select</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INTPOL</name>
                     <description>Parametric Output</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP4IENA</name>
               <addressOffset>0x00000180</addressOffset>
               <size>32</size> 
               <description>InterruptA Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INTAEN</name>
                     <description>InterruptA Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP4IENB</name>
               <addressOffset>0x00000184</addressOffset>
               <size>32</size> 
               <description>InterruptB Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INTBEN</name>
                     <description>InterruptB Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
