cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
            <register>
               <name>GP4INT</name>
               <addressOffset>0x00000188</addressOffset>
               <size>32</size> 
               <description>Interrupt Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INTSTATUS</name>
                     <description>Interrupt Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP5CON</name>
               <addressOffset>0x00000190</addressOffset>
               <size>32</size> 
               <description>GPIO Port 6 Configuration</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CON0</name>
                     <description>P5.0 Configuration Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>full_mux0</name>
                           <description>Full Mux 0</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VDAC8</name>
                           <description>VDAC8</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON1</name>
                     <description>P5.1 Configuration Bits</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>full_mux1</name>
                           <description>Full Mux 1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VDAC9</name>
                           <description>VDAC9</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON2</name>
                     <description>P5.2 Configuration Bits</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>full_mux2</name>
                           <description>Full Mux 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VDAC10</name>
                           <description>VDAC10</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON3</name>
                     <description>P5.3 Configuration Bits</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>full_mux3</name>
                           <description>Full Mux 3</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VDAC11</name>
                           <description>VDAC11</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON4</name>
                     <description>P5.4 Configuration Bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>full_mux4</name>
                           <description>Full_mux 4</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON5</name>
                     <description>P5.5 Configuration Bits</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>full_mux5</name>
                           <description>Full Mux5</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON6</name>
                     <description>P5.6 Configuration Bits</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO/IRQ_HV</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>full_mux6</name>
                           <description>Full Mux 6</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON7</name>
                     <description>P5.7 Configuration Bits</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>GPIO/IRQ_HV</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>full_mux6</name>
                           <description>Full Mux 6</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP5OE</name>
               <addressOffset>0x00000194</addressOffset>
               <size>32</size> 
               <description>GPIO Port 5 Output Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OE</name>
                     <description>Output Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP5IE</name>
               <addressOffset>0x00000198</addressOffset>
               <size>32</size> 
               <description>GPIO Port 5 Input Path Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IE</name>
                     <description>Input Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP5IN</name>
               <addressOffset>0x0000019C</addressOffset>
               <size>32</size> 
               <description>GPIO Port 5 Registered Data Input</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>Y</name>
                     <description>Data Input from Pad</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP5OUT</name>
               <addressOffset>0x000001A0</addressOffset>
               <size>32</size> 
               <description>GPIO Port 5 Data Output</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>A</name>
                     <description>Data Output to Pad</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP5SET</name>
               <addressOffset>0x000001A4</addressOffset>
               <size>32</size> 
               <description>GPIO Port 5 Data Out Set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SETUP</name>
                     <description>Set the Output HIGH for the Pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP5CLR</name>
               <addressOffset>0x000001A8</addressOffset>
               <size>32</size> 
               <description>GPIO Port 5 Data Out Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLR</name>
                     <description>Set the Output Low for the Port Pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP5TGL</name>
               <addressOffset>0x000001AC</addressOffset>
               <size>32</size> 
               <description>GPIO Port 5 Pin Toggle</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TGL</name>
                     <description>Toggle the Output of the Port Pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP5ODE</name>
               <addressOffset>0x000001B0</addressOffset>
               <size>32</size> 
               <description>GPIO Port 5 Open Drain Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ODE</name>
                     <description>Open Drain Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP5IS</name>
               <addressOffset>0x000001B4</addressOffset>
               <size>32</size> 
               <description>GPIO Port 5 Input Select</description>
               <resetValue>0x000000FF</resetValue>
               <fields>
                  <field>
                     <name>ISEL</name>
                     <description>Input Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP5PE</name>
               <addressOffset>0x000001B8</addressOffset>
               <size>32</size> 
               <description>GPIO Port 5 Pull Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PE</name>
                     <description>Pull Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP5PS</name>
               <addressOffset>0x000001BC</addressOffset>
               <size>32</size> 
               <description>GPIO Port 5 Pull Select</description>
               <resetValue>0x000000FF</resetValue>
               <fields>
                  <field>
                     <name>PS</name>
                     <description>Pull Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GP5SR</name>
               <addressOffset>0x000001C0</addressOffset>
               <size>32</size> 
               <description>GPIO Port 5 Slew Rate</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SR</name>
                     <description>Slew Rate</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
