cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>CLK</name>
         <description>Unknown</description>
         <baseAddress>0x40060000</baseAddress>
         <groupName>CLK</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CLKCON0</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size> 
               <description>Misc Clock Settings Register</description>
               <resetValue>0x0000043C</resetValue>
               <fields>
                  <field>
                     <name>CLKMUX</name>
                     <description>Clock Mux Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>HFOSC</name>
                           <description>High Frequency Internal Oscillator (HFOSC)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPLL</name>
                           <description>System PLL is Selected (160 MHz)</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EXTCLK</name>
                           <description>External GPIO Port is Selected (ECLKIN)</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLKOUT</name>
                     <description>GPIO CLK Out Select</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>HFOSC</name>
                           <description>HFOSC (16 MHz)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ROOT</name>
                           <description>Root Clock</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LFOSC</name>
                           <description>32K OSC</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CORE</name>
                           <description>Core Clock</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>B0_PCLK</name>
                           <description>Bridge 0 Pclk</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>B1_PCLK</name>
                           <description>Bridge 1 PCLK</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>B2_PCLK</name>
                           <description>Bridge 2 PCLK</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ana_clk</name>
                           <description>Analog Test Signal</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>T0</name>
                           <description>Timer 0 Clock</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WUT</name>
                           <description>Wake up Timer Clock</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>T3</name>
                           <description>Timer 3 Clock</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HCLKBUS</name>
                           <description>Hclk_bus</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPLL_CLK</name>
                           <description>SPLL clock</description>
                           <value>13</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ANACLKMUX</name>
                     <description>Mux Selection Analog Clock Source</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>HFOSC</name>
                           <description>Internal Oscillator is Selected (HFOSC)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GPIOCLK</name>
                           <description>GPIO Clock</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPLLIE</name>
                     <description>PLL Unlock and Lock Interrupt Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>PLL Interrupt Will Not Be Generated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>PLL Interrupt Will Be Generated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ANAROOTCLKMUX</name>
                     <description>Clock Mux Select</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>OSC16</name>
                           <description>16MHz Oscillator Clock</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSC32</name>
                           <description>32MHz Oscillator Clock</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLL</name>
                           <description>PLL Clock</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>External GPIO Clock</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKCON1</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size> 
               <description>Clock Dividers Register</description>
               <resetValue>0x00000048</resetValue>
               <fields>
                  <field>
                     <name>CDHCLK</name>
                     <description>HCLK Divide Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIV1</name>
                           <description>DIV1. Divide by 1 (HCLK is Equal to Root Clock)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>DIV2. Divide by 2 (HCLK is Half the Frequency of Root Clock)</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV4</name>
                           <description>DIV4. Divide by 4 (HCLK is Quarter the Frequency of Root Clock)</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV8</name>
                           <description>DIV8. Divide by 8</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16</name>
                           <description>DIV16.Divide by 16</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV32</name>
                           <description>DIV32.Divide by 32</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV64</name>
                           <description>DIV64.Divide by 64</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV128</name>
                           <description>DIV128. Divide by 128</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CDPCLK0</name>
                     <description>APB0 PCLK Divide Bits</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIV1</name>
                           <description>DIV1. Divide by 1 (PCLK is Equal to Root Clock)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>DIV2. Divide by 2 (PCLK is Half the Frequency of Root Clock)</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV4</name>
                           <description>DIV4. Divide by 4 (PCLK is Quarter the Frequency of Root Clock, 20 MHz)</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV8</name>
                           <description>DIV8. Divide by 8</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16</name>
                           <description>DIV16. Divide by 16</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV32</name>
                           <description>DIV32. Divide by 32</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV64</name>
                           <description>DIV64. Divide by 164</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV128</name>
                           <description>DIV128. Divide by 128</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CDPCLK1</name>
                     <description>APB1 PCLK Divide Bits</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIV1</name>
                           <description>DIV1. Divide by 1 (PCLK is Equal to Root Clock)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>DIV2. Divide by 2 (PCLK is Half the Frequency of Root Clock)</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV4</name>
                           <description>DIV4. Divide by 4 (PCLK is Quarter the Frequency of Root Clock, 20 MHz)</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV8</name>
                           <description>DIV8. Divide by 8</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16</name>
                           <description>DIV16. Divide by 16</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV32</name>
                           <description>DIV32. Divide by 32</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV64</name>
                           <description>DIV64. Divide by 164</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV128</name>
                           <description>DIV128. Divide by 128</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CDADCCLK</name>
                     <description>ADCCLK Divide Bits</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIV1</name>
                           <description>DIV1. Divide by 1 (ADCCLK is Equal to Root Clock)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>DIV2. Divide by 2 (ADCCLK is Half the Frequency of Root Clock)</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV4</name>
                           <description>DIV4. Divide by 4 (ADCCLK is Quarter the Frequency of Root Clock, 20 MHz)</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV8</name>
                           <description>DIV8. Divide by 8</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16</name>
                           <description>DIV16. Divide by 16</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV32</name>
                           <description>DIV32. Divide by 32</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV64</name>
                           <description>DIV64. Divide by 164</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV128</name>
                           <description>DIV128. Divide by 128</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
