cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
            <register>
               <name>CLKSTAT0</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size> 
               <description>Clocking Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SPLLSTATUS</name>
                     <description>System PLL Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>UNLOCKED</name>
                           <description>The PLL is Not Locked or Not Properly Configured. the PLL is Not Ready for Use as the System Clock Source</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>The PLL is Locked and is Ready for Use as the System Clock Source</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPLLLOCKCLR</name>
                     <description>System PLL Lock</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>UNLOCKED</name>
                           <description>No PLL Lock Event Was Detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>A PLL Lock Event Was Detected</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPLLUNLOCKCLR</name>
                     <description>System PLL Unlock</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOLOSS</name>
                           <description>No Loss of PLL Lock Was Detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOSS</name>
                           <description>A PLL Loss of Lock Was Detected</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPLLLOCK</name>
                     <description>Sticky System PLL Lock Flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>UNLOCKED</name>
                           <description>No PLL Lock Event Was Detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>A PLL Lock Event Was Detected</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPLLUNLOCK</name>
                     <description>Sticky System PLL Unlock Flag</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>UNLOCKED</name>
                           <description>No PLL Lock Event Was Detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>A PLL Lock Event Was Detected</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>PWM</name>
         <description>Unknown</description>
         <baseAddress>0x40064000</baseAddress>
         <groupName>PWM</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000080</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>PWM_TRIP</name>
	    <value>34</value>
	    <description>PWM_TRIP</description>
	 </interrupt>
	 <interrupt>
	    <name>PWM0</name>
	    <value>35</value>
	    <description>PWM0</description>
	 </interrupt>
	 <interrupt>
	    <name>PWM1</name>
	    <value>36</value>
	    <description>PWM1</description>
	 </interrupt>
	 <interrupt>
	    <name>PWM2</name>
	    <value>37</value>
	    <description>PWM2</description>
	 </interrupt>
	 <interrupt>
	    <name>PWM3</name>
	    <value>38</value>
	    <description>PWM3</description>
	 </interrupt>
         <registers>
            <register>
               <name>PWMCON0</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size> 
               <description>PWM Control Register</description>
               <resetValue>0x00000012</resetValue>
               <fields>
                  <field>
                     <name>PWMEN</name>
                     <description>Master Enable for PWM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable All PWM Outputs</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>Enable All PWM Outputs</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HMODE</name>
                     <description>Set to Enable H-bridge Mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>HDIR</name>
                     <description>Direction Control When PWM is in H-bridge Mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>PWM2 and PWM3 Act as Output Signals While PWM0 and PWM1 are Held Low</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>PWM0 and PWM1 Act as Output Signals While PWM2 and PWM3 are Held Low</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LCOMP</name>
                     <description>Signal to Load a New Set of Compare Register Values</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Use the Values Previously Store in the Compare and Length Registers</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>Load the Internal Compare Registers with Values Stored in the PWMxCOMx and PWMxLEN Registers</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HOFF</name>
                     <description>Set to Turn off the High-side for Pair 0/1 in H-bridge Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>POINV</name>
                     <description>Set to Invert PWM Outputs for Pair 0/1 in H-bridge Mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PWMCMP</name>
                     <description>PWM Clock Prescaler. Sets UCLK Divider.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>UCLK/2</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV4</name>
                           <description>UCLK/4</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV8</name>
                           <description>UCLK/8</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16</name>
                           <description>UCLK/16</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV32</name>
                           <description>UCLK/32</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV64</name>
                           <description>UCLK/64</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV128</name>
                           <description>UCLK/128</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV256</name>
                           <description>UCLK/256</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENA</name>
                     <description>Enable for Pair 0 and 1 When HOFF=0 and HMODE=1</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable Pair 0 and 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>Enable Pair 0 and 1</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PWMIEN</name>
                     <description>Set to Enable Interrupts for PWM</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PWM1INV</name>
                     <description>Set to Invert PWM1 Output</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PWM3INV</name>
                     <description>Set to Invert PWM3 Output</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PWM5INV</name>
                     <description>Set to Invert PWM5 Output</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PWM7INV</name>
                     <description>Set to Invert PWM7 Output</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SYNC</name>
                     <description>Set to Enable PWM Synchronization from the SYNC Pin</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Ignore Transition from the SYNC Pin</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>All PWM Counters are Reset on the Next Clock Cycle After Detection of a Falling Edge from SYNC Pin</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWMCON1</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size> 
               <description>ADC Conversion Start and Trip Control Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>REVREG0</name>
                     <description>Reserved</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TRIP_EN</name>
                     <description>Set to Enable PWM Trip Functionality</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>REVREG1</name>
                     <description>Reserved. Return 0 on Reads</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWMICLR</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size> 
               <description>Hardware Trip Configuration Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWM0</name>
                     <description>Write a 1 to Clear Latched IRQPWM0 Interrupt.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PWM1</name>
                     <description>Write a 1 to Clear Latched IRQPWM1 Interrupt.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PWM2</name>
                     <description>Write a 1 to Clear Latched IRQPWM2 Interrupt.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PWM3</name>
                     <description>Write a 1 to Clear Latched IRQPWM3 Interrupt.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TRIP</name>
                     <description>Write a 1 to Clear Latched IRQPWMTrip Interrupt.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>REVREG2</name>
                     <description>Reserved. Return 0 on Reads</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>11</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
