cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
            <register>
               <name>PWM0COM0</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size> 
               <description>Compare Register 0 for PWM0 and PWM1</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWM0COM0</name>
                     <description>Compare Register 0 for PWM0 and PWM1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM0COM1</name>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size> 
               <description>Compare Register 1 for PWM0 and PWM1</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWM0COM1</name>
                     <description>Compare Register 1 for PWM0 and PWM1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM0COM2</name>
               <addressOffset>0x00000018</addressOffset>
               <size>32</size> 
               <description>Compare Register 2 for PWM0 and PWM1</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWM0COM2</name>
                     <description>Compare Register 2 for PWM0 and PWM1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM0LEN</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>32</size> 
               <description>Period Value Register for PWM0 and PWM1</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWM0LEN</name>
                     <description>Period Value Register for PWM0 and PWM1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM1COM0</name>
               <addressOffset>0x00000020</addressOffset>
               <size>32</size> 
               <description>Compare Register 0 for PWM2 and PWM3</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWM1COM0</name>
                     <description>Compare Register 0 for PWM2 and PWM3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM1COM1</name>
               <addressOffset>0x00000024</addressOffset>
               <size>32</size> 
               <description>Compare Register 1 for PWM2 and PWM3</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWM1COM1</name>
                     <description>Compare Register 1 for PWM2 and PWM3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM1COM2</name>
               <addressOffset>0x00000028</addressOffset>
               <size>32</size> 
               <description>Compare Register 2 for PWM2 and PWM3</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWM1COM2</name>
                     <description>Compare Register 2 for PWM2 and PWM3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM1LEN</name>
               <addressOffset>0x0000002C</addressOffset>
               <size>32</size> 
               <description>Period Value Register for PWM2 and PWM3</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWM1LEN</name>
                     <description>Period Value Register for PWM2 and PWM3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM2COM0</name>
               <addressOffset>0x00000030</addressOffset>
               <size>32</size> 
               <description>Compare Register 0 for PWM4 and PWM5</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWM2COM0</name>
                     <description>Compare Register 0 for PWM4 and PWM5</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM2COM1</name>
               <addressOffset>0x00000034</addressOffset>
               <size>32</size> 
               <description>Compare Register 1 for PWM4 and PWM5</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWM2COM1</name>
                     <description>Compare Register 1 for PWM4 and PWM5</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM2COM2</name>
               <addressOffset>0x00000038</addressOffset>
               <size>32</size> 
               <description>Compare Register 2 for PWM4 and PWM5</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWM2COM2</name>
                     <description>Compare Register 2 for PWM4 and PWM5</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM2LEN</name>
               <addressOffset>0x0000003C</addressOffset>
               <size>32</size> 
               <description>Period Value Register for PWM4 and PWM5</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWM2LEN</name>
                     <description>Period Value Register for PWM4 and PWM5</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM3COM0</name>
               <addressOffset>0x00000040</addressOffset>
               <size>32</size> 
               <description>Compare Register 0 for PWM6 and PWM7</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWM3COM0</name>
                     <description>Compare Register 0 for PWM6 and PWM7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM3COM1</name>
               <addressOffset>0x00000044</addressOffset>
               <size>32</size> 
               <description>Compare Register 1 for PWM6 and PWM7</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWM3COM1</name>
                     <description>Compare Register 1 for PWM6 and PWM7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM3COM2</name>
               <addressOffset>0x00000048</addressOffset>
               <size>32</size> 
               <description>Compare Register 2 for PWM6 and PWM7</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWM3COM2</name>
                     <description>Compare Register 2 for PWM6 and PWM7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM3LEN</name>
               <addressOffset>0x0000004C</addressOffset>
               <size>32</size> 
               <description>Period Value Register for PWM6 and PWM7</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWM3LEN</name>
                     <description>Period Value Register for PWM6 and PWM7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
