cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>SRAM</name>
         <description>Unknown</description>
         <baseAddress>0x40065000</baseAddress>
         <groupName>SRAM</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00001000</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>SRAM_ERR</name>
	    <value>39</value>
	    <description>SRAM_ERR</description>
	 </interrupt>
         <registers>
            <register>
               <name>SRAMCON</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>SRAM Control Register</description>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>REMAP</name>
                     <description>Using SRAM0 as Instruction SRAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CODRAM</name>
                           <description>Using as Code SRAM</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYSRAM</name>
                           <description>Using as System SRAM</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CSEL</name>
                     <description>Use Cache as a Part of SRAM0</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NCAS</name>
                           <description>Cache not as SRAM</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CAS</name>
                           <description>Cache as SRAM</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRAMECCCON</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <description>SRAM ECC Control Register</description>
               <resetValue>0x000000CF</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>ECC Check Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ENNA</name>
                           <description>None SRAM ECC Enable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN0</name>
                           <description>SRAM0 ECC Enable</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN1</name>
                           <description>SRAM1 ECC Enable</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN01</name>
                           <description>SRAM0 and SRAM1 ECC Enable</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN2</name>
                           <description>SRAM2 ECC Enable</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN02</name>
                           <description>SRAM0 and SRAM2 ECC Enable</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN12</name>
                           <description>SRAM1 and SRAM2 ECC Enable</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN012</name>
                           <description>SRAM0 and SRAM1 and SRAM2 ECC Enable</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BUSERRTYPE</name>
                     <description>ECC AHB Bus Error Response Type</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOERR</name>
                           <description>No Error Report</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERR2B</name>
                           <description>2 Bits Error Report</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERR1B</name>
                           <description>1 Bit Error Report</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALERR</name>
                           <description>1 or 2 Bits Error Report</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INTERRTYPE</name>
                     <description>ECC Interrupt Error Response Type</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOERR</name>
                           <description>No Error Report</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERR2B</name>
                           <description>2 Bits Error Report</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERR1B</name>
                           <description>1 Bit Error Report</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALERR</name>
                           <description>1 or 2 Bits Error Report</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RECERRTYPE</name>
                     <description>ECC Error Address and Data Record Type</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CURERR</name>
                           <description>Return Current Error Address and Data Information</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRERR0</name>
                           <description>Return Stored Error Address and Data Information</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRERR12</name>
                           <description>Return Stored Error Address and Data Information</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STRERR13</name>
                           <description>Return Stored Error Address and Data Information</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRAMECCSTA</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size>
               <description>SRAM ECC Status Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>S0ERR2B</name>
                     <description>SRAM0 ECC 2 Bits Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>S0ERR1B</name>
                     <description>SRAM0 ECC 1 Bit Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>S1ERR2B</name>
                     <description>SRAM1 ECC 2 Bits Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>S1ERR1B</name>
                     <description>SRAM1 ECC 1 Bit Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>S2ERR2B</name>
                     <description>SRAM2 ECC 2 Bits Error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>S2ERR1B</name>
                     <description>SRAM2 ECC 1 Bits Error</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ERRCNT</name>
                     <description>ECC Error Counter</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRAMECCA0</name>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size>
               <description>SRAM0 ECC Error Address Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>ECC Error Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRAMECCD0</name>
               <addressOffset>0x00000018</addressOffset>
               <size>32</size>
               <description>SRAM0 ECC Error Data Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>ECC Error Raw Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRAMECCP0</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>32</size>
               <description>SRAM0 ECC Error Parity Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PARITY</name>
                     <description>ECC Error Raw Parity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRAMECCA1</name>
               <addressOffset>0x00000020</addressOffset>
               <size>32</size>
               <description>SRAM1 ECC Error Address Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>ECC Error Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRAMECCD1</name>
               <addressOffset>0x00000024</addressOffset>
               <size>32</size>
               <description>SRAM1 ECC Error Data Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>ECC Error Raw Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRAMECCP1</name>
               <addressOffset>0x00000028</addressOffset>
               <size>32</size>
               <description>SRAM1 ECC Error Parity Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PARITY</name>
                     <description>ECC Error Raw Parity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRAMECCA2</name>
               <addressOffset>0x0000002C</addressOffset>
               <size>32</size>
               <description>SRAM2 ECC Error Address Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>ECC Error Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRAMECCD2</name>
               <addressOffset>0x00000030</addressOffset>
               <size>32</size>
               <description>SRAM2 ECC Error Data Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>ECC Error Raw Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRAMECCP2</name>
               <addressOffset>0x00000034</addressOffset>
               <size>32</size>
               <description>SRAM2 ECC Error Parity Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PARITY</name>
                     <description>ECC Error Raw Parity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
