cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>CRC</name>
         <description>Unknown</description>
         <baseAddress>0x40066000</baseAddress>
         <groupName>CRC</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTL</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>CRC Control Register</description>
               <resetValue>0x10000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>CRC Peripheral Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>LSBFIRST</name>
                     <description>LSB First Calculation Order</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>BITMIRR</name>
                     <description>Bit Mirroring</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>BYTMIRR</name>
                     <description>Byte Mirroring</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>W16SWP</name>
                     <description>Word16 Swap</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>RevID</name>
                     <description>Revision ID</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPDATA</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <description>Input Data Word Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA_WORD</name>
                     <description>Data Input.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>RESULT</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <description>CRC Result Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RESIDUE</name>
                     <description>CRC Residue</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>POLY</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <description>Programmable CRC Polynomial</description>
               <resetValue>0x04C11DB7</resetValue>
               <fields>
                  <field>
                     <name>REDUCTION_POLY</name>
                     <description>CRC Reduction Polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
