cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>ADC</name>
         <description>Unknown</description>
         <baseAddress>0x40068000</baseAddress>
         <groupName>ADC</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000800</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>ADC</name>
	    <value>66</value>
	    <description>ADC</description>
	 </interrupt>
	 <interrupt>
	    <name>SEQ</name>
	    <value>67</value>
	    <description>SEQ</description>
	 </interrupt>
	 <interrupt>
	    <name>DIG_COMP</name>
	    <value>86</value>
	    <description>DIG_COMP</description>
	 </interrupt>
         <registers>
            <register>
               <dim>30</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29</dimIndex>
               <name>ADCDAT[%s]</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>ADCx Data and Flags</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OVF</name>
                     <description>Overflow Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOVF</name>
                           <description>Not Overflow</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OVF</name>
                           <description>Overflow</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UVF</name>
                     <description>Underflow Flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NUNF</name>
                           <description>Not Underflow</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNF</name>
                           <description>Underflow</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RDY</name>
                     <description>Data Read Flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NORDY</name>
                           <description>Data is Not Ready or Has Been Read Out</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RDY</name>
                           <description>Data is Ready to Be Read</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DAT</name>
                     <description>ADCx Data</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCCON</name>
               <addressOffset>0x00000078</addressOffset>
               <size>32</size>
               <description>ADC Configuration</description>
               <resetValue>0x00000200</resetValue>
               <fields>
                  <field>
                     <name>CONVTYPE</name>
                     <description>ADC Conversion Type Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IDLE</name>
                           <description>No Conversion</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GPIO</name>
                           <description>ADC Controlled by GPIO Pin</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGL</name>
                           <description>Software Single Conversion</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CONT</name>
                           <description>Software Continue Conversion</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLA</name>
                           <description>PLA Conversion</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GPT</name>
                           <description>GPT Triggered Conversion</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CNVDMA</name>
                     <description>DMA Request Enable for ADC Non-sequence Conversion</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SEQDMA</name>
                     <description>DMA Request Enable for ADC Sequence Conversion</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PINMOD</name>
                     <description>PIN Conversion Mode Selection</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PIN_LVL</name>
                           <description>CNV is Controlled by PIN Level</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PIN_EDGE</name>
                           <description>CNV is Controlled by PIN Edge</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RESTARTADC</name>
                     <description>Restart ADC, Reset Analog Part of ADC</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ADCPU</name>
                           <description>Not Power Down ADC</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADCPD</name>
                           <description>Power Down ADC</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PDREFBUF</name>
                     <description>ADC Refbuf Power Down</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>REFBUFPU</name>
                           <description>Normal Mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFBUFPD</name>
                           <description>Power Down Reference Mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VDDSEL</name>
                     <description>Select Whether Channel 29 is DVDD Channel or AVDD Channel</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DVDD</name>
                           <description>Channel 29 is Half of DVDD Channel</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AVSS</name>
                           <description>Channel 29 is AVSS Channel</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PDADC</name>
                     <description>ADC Power Down</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ADCPU</name>
                           <description>Not Power Down ADC</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADCPD</name>
                           <description>Power Down ADC</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OSR</name>
                     <description>Oversampling Ratio</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>OSR_NS1</name>
                           <description>Oversampling Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR2</name>
                           <description>Oversampling X2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR4</name>
                           <description>Oversampling X4</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR8</name>
                           <description>Oversampling X8</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR16</name>
                           <description>Oversampling X16</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR_NS32</name>
                           <description>Oversampling X32</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR_NS64</name>
                           <description>Oversampling Disable</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR_NS128</name>
                           <description>Oversampling Disable</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CNVIRQEN</name>
                     <description>Enable Conversion Interrupt Generation</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>GPTEVENTEN</name>
                     <description>Enable GPT Event to Trigger Conversion</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000001F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>GPTTRIGMD</name>
                     <description>Mux Select GP Timer Trigger Mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>MD0</name>
                           <description>Two Timeout Events Trigger One Conversion</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MD1</name>
                           <description>One Timeout Events Trigger One Conversion</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PREBUFCON</name>
               <addressOffset>0x0000007C</addressOffset>
               <size>32</size>
               <description>Pre-charge Buffer Control</description>
               <resetValue>0x00000003</resetValue>
               <fields>
                  <field>
                     <name>PRGBYPP</name>
                     <description>Bypass P Channel Pre_buf</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PRGBYPN</name>
                     <description>Bypass N Channel Pre_buf</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCCNVC</name>
               <addressOffset>0x00000080</addressOffset>
               <size>32</size>
               <description>ADC Conversion Cycle for Positive Input Channels</description>
               <resetValue>0x00000010</resetValue>
               <fields>
                  <field>
                     <name>CNVC</name>
                     <description>CNV Frequency Configuration for Positive Channels</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCCNVCSLOW</name>
               <addressOffset>0x00000084</addressOffset>
               <size>32</size>
               <description>ADC Conversion Cycle for Positive Input Channels</description>
               <resetValue>0x00000140</resetValue>
               <fields>
                  <field>
                     <name>CNVCSLOW</name>
                     <description>CNV Frequency Configuration for 100KSPS Channels</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
