cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
            <register>
               <name>ADCCHA</name>
               <addressOffset>0x00000088</addressOffset>
               <size>32</size>
               <description>ADC Channel Select</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADCCP</name>
                     <description>ADC P Channel Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>AIN0</name>
                           <description>Unknown</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN1</name>
                           <description>Unknown</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN2</name>
                           <description>Unknown</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN3</name>
                           <description>Unknown</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN4</name>
                           <description>Unknown</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN5</name>
                           <description>Unknown</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN6</name>
                           <description>Unknown</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN7</name>
                           <description>Unknown</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN8</name>
                           <description>Unknown</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN9</name>
                           <description>Unknown</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN10</name>
                           <description>Unknown</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN11</name>
                           <description>Unknown</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN12</name>
                           <description>Unknown</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN13</name>
                           <description>Unknown</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN14</name>
                           <description>Unknown</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN15</name>
                           <description>Unknown</description>
                           <value>15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PGA0</name>
                           <description>Unknown</description>
                           <value>16</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PGA1</name>
                           <description>Unknown</description>
                           <value>17</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PGA2</name>
                           <description>Unknown</description>
                           <value>18</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PGA3</name>
                           <description>Unknown</description>
                           <value>19</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TEMPSNS</name>
                           <description>Unknown</description>
                           <value>20</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AVDDDIV2</name>
                           <description>Unknown</description>
                           <value>21</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IOVDD0DIV2</name>
                           <description>Unknown</description>
                           <value>22</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IOVDD1</name>
                           <description>Unknown</description>
                           <value>23</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HVTIA0</name>
                           <description>Unknown</description>
                           <value>24</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HVTIA1</name>
                           <description>Unknown</description>
                           <value>25</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HVTIA2</name>
                           <description>Unknown</description>
                           <value>26</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HVTIA3</name>
                           <description>Unknown</description>
                           <value>27</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HVTIA4</name>
                           <description>Unknown</description>
                           <value>28</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AVSS</name>
                           <description>Unknown</description>
                           <value>29</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADCCN</name>
                     <description>ADC N Channel Selection</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCIRQSTAT</name>
               <addressOffset>0x0000008C</addressOffset>
               <size>32</size>
               <description>ADC Interrupt Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNVIRQSTAT</name>
                     <description>Single Conversion IRQ Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IRQCLR</name>
                           <description>Interrupt Clear</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IRQSET</name>
                           <description>Interrupt Set</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SEQIRQSTAT</name>
                     <description>Sequence Conversion IRQ Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IRQCLR</name>
                           <description>Interrupt Clear</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IRQSET</name>
                           <description>Interrupt Set</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCSEQ</name>
               <addressOffset>0x00000090</addressOffset>
               <size>32</size>
               <description>ADC Sequencer Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SEQEN</name>
                     <description>Sequence Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SEQREN</name>
                     <description>Sequence Restart</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SEQSTL</name>
                     <description>Sequence Stall</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SEQNSTALL</name>
                           <description>Running Sequence</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEQSTALL</name>
                           <description>Stalling Sequence</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SEQIRQEN</name>
                     <description>Enable Sequencer Interrupt Generation</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCSEQC</name>
               <addressOffset>0x00000094</addressOffset>
               <size>32</size>
               <description>ADC Sequencer Configuration</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SEQT</name>
                     <description>Repeat Sequence Interval</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCSEQS</name>
               <addressOffset>0x00000098</addressOffset>
               <size>32</size>
               <description>ADC Sequencer Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNVSTAT</name>
                     <description>ADC Conversion Idle/Busy Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CNVIDLE</name>
                           <description>ADC Conversion is Idle</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CNVBUSY</name>
                           <description>ADC Conversion is Busy</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SEQSTLSTAT</name>
                     <description>Stall Sequencer Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SEQNSTOP</name>
                           <description>Sequence Still Run</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEQSTOP</name>
                           <description>Sequence Has Stalled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SEQSTAT</name>
                     <description>Sequencer Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SEQNBUSY</name>
                           <description>Sequence is Idle</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEQBUSY</name>
                           <description>Sequence is Busy</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCSEQCH</name>
               <addressOffset>0x0000009C</addressOffset>
               <size>32</size>
               <description>ADC Sequencer Channel 0</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SEQCH</name>
                     <description>Sequence Channel Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>30</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x3FFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
