cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
            <register>
               <name>ADCSEQCHMUX0</name>
               <addressOffset>0x000000A0</addressOffset>
               <size>32</size>
               <description>ADC Sequencer Channel 1</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIF0</name>
                     <description>When AIN0 is P Ch. N Ch. Mux Selection in Sequencer Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>REFN</name>
                           <description>Unknown</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFP</name>
                           <description>Unknown</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN1</name>
                           <description>Unknown</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN3</name>
                           <description>Unknown</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN5</name>
                           <description>Unknown</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN7</name>
                           <description>Unknown</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN9</name>
                           <description>Unknown</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN11</name>
                           <description>Unknown</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN13</name>
                           <description>Unknown</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN15</name>
                           <description>Unknown</description>
                           <value>9</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIF1</name>
                     <description>When AIN1 is N Ch. P Ch. Mux Selection in Sequencer Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>REFN</name>
                           <description>Unknown</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFP</name>
                           <description>Unknown</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIF2</name>
                     <description>When AIN2 is P Ch. N Ch. Mux Selection in Sequencer Mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>REFN</name>
                           <description>Unknown</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFP</name>
                           <description>Unknown</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN1</name>
                           <description>Unknown</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN3</name>
                           <description>Unknown</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN5</name>
                           <description>Unknown</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN7</name>
                           <description>Unknown</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN9</name>
                           <description>Unknown</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN11</name>
                           <description>Unknown</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN13</name>
                           <description>Unknown</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN15</name>
                           <description>Unknown</description>
                           <value>9</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIF3</name>
                     <description>When AIN3 is N Ch. P Ch. Mux Selection in Sequencer Mode</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>REFN</name>
                           <description>Unknown</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFP</name>
                           <description>Unknown</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIF4</name>
                     <description>When AIN4 is P Ch. N Ch. Mux Selection in Sequencer Mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>REFN</name>
                           <description>Unknown</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFP</name>
                           <description>Unknown</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN1</name>
                           <description>Unknown</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN3</name>
                           <description>Unknown</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN5</name>
                           <description>Unknown</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN7</name>
                           <description>Unknown</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN9</name>
                           <description>Unknown</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN11</name>
                           <description>Unknown</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN13</name>
                           <description>Unknown</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN15</name>
                           <description>Unknown</description>
                           <value>9</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIF5</name>
                     <description>When AIN5 is N Ch. P Ch. Mux Selection in Sequencer Mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>REFN</name>
                           <description>Unknown</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFP</name>
                           <description>Unknown</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIF6</name>
                     <description>When AIN6 is P Ch. N Ch. Mux Selection in Sequencer Mode</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>REFN</name>
                           <description>Unknown</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFP</name>
                           <description>Unknown</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN1</name>
                           <description>Unknown</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN3</name>
                           <description>Unknown</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN5</name>
                           <description>Unknown</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN7</name>
                           <description>Unknown</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN9</name>
                           <description>Unknown</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN11</name>
                           <description>Unknown</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN13</name>
                           <description>Unknown</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN15</name>
                           <description>Unknown</description>
                           <value>9</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIF7</name>
                     <description>When AIN7 is N Ch. P Ch. Mux Selection in Sequencer Mode</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>REFN</name>
                           <description>Unknown</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFP</name>
                           <description>Unknown</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIF8</name>
                     <description>When AIN8 is P Ch. N Ch. Mux Selection in Sequencer Mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>REFN</name>
                           <description>Unknown</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFP</name>
                           <description>Unknown</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN1</name>
                           <description>Unknown</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN3</name>
                           <description>Unknown</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN5</name>
                           <description>Unknown</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN7</name>
                           <description>Unknown</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN9</name>
                           <description>Unknown</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN11</name>
                           <description>Unknown</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN13</name>
                           <description>Unknown</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN15</name>
                           <description>Unknown</description>
                           <value>9</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIF9</name>
                     <description>When AIN9 is N Ch. P Ch. Mux Selection in Sequencer Mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>REFN</name>
                           <description>Unknown</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFP</name>
                           <description>Unknown</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIF10</name>
                     <description>When AIN10 is P Ch. N Ch. Mux Selection in Sequencer Mode</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>REFN</name>
                           <description>Unknown</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFP</name>
                           <description>Unknown</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN1</name>
                           <description>Unknown</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN3</name>
                           <description>Unknown</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN5</name>
                           <description>Unknown</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN7</name>
                           <description>Unknown</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN9</name>
                           <description>Unknown</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN11</name>
                           <description>Unknown</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN13</name>
                           <description>Unknown</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN15</name>
                           <description>Unknown</description>
                           <value>9</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIF11</name>
                     <description>When AIN11 is N Ch. P Ch. Mux Selection in Sequencer Mode</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>REFN</name>
                           <description>Unknown</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFP</name>
                           <description>Unknown</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
