cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
            <register>
               <name>ADCSEQCHMUX1</name>
               <addressOffset>0x000000A4</addressOffset>
               <size>32</size>
               <description>ADC Sequencer Channel 1</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIF12</name>
                     <description>When AIN12 is P Ch. N Ch. Mux Selection in Sequencer Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>REFN</name>
                           <description>Unknown</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFP</name>
                           <description>Unknown</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN1</name>
                           <description>Unknown</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN3</name>
                           <description>Unknown</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN5</name>
                           <description>Unknown</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN7</name>
                           <description>Unknown</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN9</name>
                           <description>Unknown</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN11</name>
                           <description>Unknown</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN13</name>
                           <description>Unknown</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN15</name>
                           <description>Unknown</description>
                           <value>9</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIF13</name>
                     <description>When AIN13 is N Ch. P Ch. Mux Selection in Sequencer Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>REFN</name>
                           <description>Unknown</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFP</name>
                           <description>Unknown</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIF14</name>
                     <description>When AIN14 is P Ch. N Ch. Mux Selection in Sequencer Mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>REFN</name>
                           <description>Unknown</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFP</name>
                           <description>Unknown</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN1</name>
                           <description>Unknown</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN3</name>
                           <description>Unknown</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN5</name>
                           <description>Unknown</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN7</name>
                           <description>Unknown</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN9</name>
                           <description>Unknown</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN11</name>
                           <description>Unknown</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN13</name>
                           <description>Unknown</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN15</name>
                           <description>Unknown</description>
                           <value>9</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIF15</name>
                     <description>When AIN15 is N Ch. P Ch. Mux Selection in Sequencer Mode</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>REFN</name>
                           <description>Unknown</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFP</name>
                           <description>Unknown</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCCMP</name>
               <addressOffset>0x000000A8</addressOffset>
               <size>32</size>
               <description>Digital Comparator 0 Configuration</description>
               <resetValue>0x00040000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>Digital Comparator Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>CMPDIR</name>
                     <description>Select Digital Comparator Direction</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>THR</name>
                     <description>Compare Threshold</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IRQEN</name>
                     <description>Enable IRQ Generation</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>CH</name>
                     <description>Channel Index for Data Comparison</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000001F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCCMPIRQSTAT</name>
               <addressOffset>0x000000AC</addressOffset>
               <size>32</size>
               <description>Digital Comparator Interrupt Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COMP0IRQSTA</name>
                     <description>Comparator0 Interrupt Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>COMP1IRQSTA</name>
                     <description>Comparator1 Interrupt Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>COMP2IRQSTA</name>
                     <description>Comparator2 Interrupt Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>COMP3IRQSTA</name>
                     <description>Comparator3 Interrupt Status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>COMP0IRQCLR</name>
                     <description>Comparator0 Interrupt Clear</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>COMP1IRQCLR</name>
                     <description>Comparator1 Interrupt Clear</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>COMP2IRQCLR</name>
                     <description>Comparator2 Interrupt Clear</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>COMP3IRQCLR</name>
                     <description>Comparator3 Interrupt Clear</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>COMP0PLACLR</name>
                     <description>Comparator0 to PLA Clear</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>COMP1PLACLR</name>
                     <description>Comparator1 to PLA Clear</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>COMP2PLACLR</name>
                     <description>Comparator2 to PLA Clear</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>COMP3PLACLR</name>
                     <description>Comparator3 to PLA Clear</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCOFGNDIFF</name>
               <addressOffset>0x000000B0</addressOffset>
               <size>32</size>
               <description>ADC Offset Gain Differential Channel Error Correction</description>
               <resetValue>0x00004000</resetValue>
               <fields>
                  <field>
                     <name>GAIN</name>
                     <description>Gain Error Correction</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00007FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>OFFSET</name>
                     <description>Offset Error Correction</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>17</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0001FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCOFTEMP</name>
               <addressOffset>0x000000B4</addressOffset>
               <size>32</size>
               <description>ADC Offset Gain Temp Sensor Channel Error Correction</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OFFSET</name>
                     <description>Offset Error Correction</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>17</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0001FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCGNTEMP</name>
               <addressOffset>0x000000B8</addressOffset>
               <size>32</size>
               <description>ADC Offset Gain Temp Sensor Channel Error Correction</description>
               <resetValue>0x00080000</resetValue>
               <fields>
                  <field>
                     <name>GAIN</name>
                     <description>Gain Error Correction</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>20</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000FFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCOFGNPGA0</name>
               <addressOffset>0x000000BC</addressOffset>
               <size>32</size>
               <description>ADC Offset Gain PGA0 Channel Error Correction</description>
               <resetValue>0x00004000</resetValue>
               <fields>
                  <field>
                     <name>GAIN</name>
                     <description>Gain Error Correction</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00007FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCOFGNPGA1</name>
               <addressOffset>0x000000C0</addressOffset>
               <size>32</size>
               <description>ADC Offset Gain PGA1 Channel Error Correction</description>
               <resetValue>0x00004000</resetValue>
               <fields>
                  <field>
                     <name>GAIN</name>
                     <description>Gain Error Correction</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00007FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCOFGNPGA2</name>
               <addressOffset>0x000000C4</addressOffset>
               <size>32</size>
               <description>ADC Offset Gain PGA2 Channel Error Correction</description>
               <resetValue>0x00004000</resetValue>
               <fields>
                  <field>
                     <name>GAIN</name>
                     <description>Gain Error Correction</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00007FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
