cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
            <register>
               <name>ADCOFGNPGA3</name>
               <addressOffset>0x000000C8</addressOffset>
               <size>32</size>
               <description>ADC Offset Gain PGA3 Channel Error Correction</description>
               <resetValue>0x00004000</resetValue>
               <fields>
                  <field>
                     <name>GAIN</name>
                     <description>Gain Error Correction</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00007FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCOFGNPGA0TIA</name>
               <addressOffset>0x000000CC</addressOffset>
               <size>32</size>
               <description>ADC Offset Gain PGA0 Channel Error Correction</description>
               <resetValue>0x00004000</resetValue>
               <fields>
                  <field>
                     <name>GAIN</name>
                     <description>Gain Error Correction</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00007FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCOFGNPGA1TIA</name>
               <addressOffset>0x000000D0</addressOffset>
               <size>32</size>
               <description>ADC Offset Gain PGA1 Channel Error Correction</description>
               <resetValue>0x00004000</resetValue>
               <fields>
                  <field>
                     <name>GAIN</name>
                     <description>Gain Error Correction</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00007FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCOFGNPGA2TIA</name>
               <addressOffset>0x000000D4</addressOffset>
               <size>32</size>
               <description>ADC Offset Gain PGA2 Channel Error Correction</description>
               <resetValue>0x00004000</resetValue>
               <fields>
                  <field>
                     <name>GAIN</name>
                     <description>Gain Error Correction</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00007FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCOFGNPGA3TIA</name>
               <addressOffset>0x000000D8</addressOffset>
               <size>32</size>
               <description>ADC Offset Gain PGA3 Channel Error Correction</description>
               <resetValue>0x00004000</resetValue>
               <fields>
                  <field>
                     <name>GAIN</name>
                     <description>Gain Error Correction</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00007FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCCMP1</name>
               <addressOffset>0x00000154</addressOffset>
               <size>32</size>
               <description>Digital Comparator 1 Configuration</description>
               <resetValue>0x00040000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>Digital Comparator Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>CMPDIR</name>
                     <description>Select Digital Comparator Direction</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>THR</name>
                     <description>Compare Threshold</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IRQEN</name>
                     <description>Enable IRQ Generation</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>CH</name>
                     <description>Channel Index for Data Comparison</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000001F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCCMP2</name>
               <addressOffset>0x00000158</addressOffset>
               <size>32</size>
               <description>Digital Comparator 2 Configuration</description>
               <resetValue>0x00040000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>Digital Comparator Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>CMPDIR</name>
                     <description>Select Digital Comparator Direction</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>THR</name>
                     <description>Compare Threshold</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IRQEN</name>
                     <description>Enable IRQ Generation</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>CH</name>
                     <description>Channel Index for Data Comparison</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000001F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCCMP3</name>
               <addressOffset>0x0000015C</addressOffset>
               <size>32</size>
               <description>Digital Comparator 3 Configuration</description>
               <resetValue>0x00040000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>Digital Comparator Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>CMPDIR</name>
                     <description>Select Digital Comparator Direction</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>THR</name>
                     <description>Compare Threshold</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IRQEN</name>
                     <description>Enable IRQ Generation</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>CH</name>
                     <description>Channel Index for Data Comparison</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000001F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
