cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>COMP</name>
         <description>Unknown</description>
         <baseAddress>0x40068A00</baseAddress>
         <groupName>COMP</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000200</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>COMP0</name>
	    <value>68</value>
	    <description>COMP0</description>
	 </interrupt>
	 <interrupt>
	    <name>COMP1</name>
	    <value>69</value>
	    <description>COMP1</description>
	 </interrupt>
	 <interrupt>
	    <name>COMP2</name>
	    <value>70</value>
	    <description>COMP2</description>
	 </interrupt>
	 <interrupt>
	    <name>COMP3</name>
	    <value>71</value>
	    <description>COMP3</description>
	 </interrupt>
         <registers>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>COMPCON[%s]</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>Unknown</description>
               <resetValue>0x00000060</resetValue>
               <fields>
                  <field>
                     <name>HYS</name>
                     <description>Comp Hysteresis Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>hysteresis disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN10MV</name>
                           <description>10mv hysteresis enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN25MV</name>
                           <description>25mv hysteresis</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN35MV</name>
                           <description>35mv hysteresis</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN50MV</name>
                           <description>50mv hysteresis</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN60MV</name>
                           <description>60mv hysteresis</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN75MV</name>
                           <description>75mv hysteresis</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN85MV</name>
                           <description>85mv hysteresis</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN100MV</name>
                           <description>100mv hysteresis</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN110MV</name>
                           <description>110mv hysteresis</description>
                           <value>17</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN125MV</name>
                           <description>125mv hysteresis</description>
                           <value>18</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN135MV</name>
                           <description>135mv hysteresis</description>
                           <value>19</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN150MV</name>
                           <description>150mv hysteresis</description>
                           <value>22</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN160MV</name>
                           <description>160mv hysteresis</description>
                           <value>23</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN175MV</name>
                           <description>175mv hysteresis</description>
                           <value>28</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN185MV</name>
                           <description>185mv hysteresis</description>
                           <value>29</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN200MV</name>
                           <description>200mv hysteresis</description>
                           <value>30</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN210MV</name>
                           <description>210mv hysteresis</description>
                           <value>31</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INV</name>
                     <description>Select Output Logic State</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOM</name>
                           <description>Output is High if +ve is higher than -ve input</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COV</name>
                           <description>Output is High if -ve is higher than +ve input</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OUT</name>
                     <description>Comp Interrupt Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS00</name>
                           <description>Output to Test Pad Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIS01</name>
                           <description>Output to Test Pad Disable</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN10</name>
                           <description>Output to Test Pad Enable</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIS11</name>
                           <description>Output to Test Pad Disable</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INNEG</name>
                     <description>Select Comparator Negative Input Source</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_INPUT</name>
                           <description>All Input Switches Off</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AHIDIV2IN</name>
                           <description>Enable Half Avdd Input</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AINxN</name>
                           <description>Enable AIN9/11/13/15 for Comp 0/1/2/3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VDAC8IN</name>
                           <description>Enable VDAC8 Input</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VDAC9IN</name>
                           <description>Enable VDAC9 Input</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VDAC10IN</name>
                           <description>Enable VDAC10 Input</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VDAC11IN</name>
                           <description>Enable VDAC11 Input</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>V1P25REFIN</name>
                           <description>Enable 1.25V Ref Input from AIN15(BUF1)</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INPOS</name>
                     <description>Select Comparator Positive Input Source</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_INPUT</name>
                           <description>All Input Switches Off</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AINxP</name>
                           <description>Enable AIN8/10/12/14 for comp 0/1/2/3</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PGAIN</name>
                           <description>Enable PGA0/1/2/3 for comp 0/1/2/3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GPIO_ANAIN</name>
                           <description>Enable GPIO0.6/0.7/2.0/2.1 Analog Signal Input for comp 0/1/2/3</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Enable Comparator</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>INTEN</name>
                     <description>Interrupt Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>INTMODE</name>
                     <description>Interrupt Mode</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RISEEDGE</name>
                           <description>Generate Interrupt if Rising Edge Happens</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALLEDGE</name>
                           <description>Generate Interrupt if Falling Edge Happens</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOWLEVEL</name>
                           <description>Generate Interrupt if Low Level Happens</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGHLEVEL</name>
                           <description>Generate Interrupt if High Level Happens</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMPIRQSTAT</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size>
               <description>Unknown</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COMP0</name>
                     <description>Comparator 0 Interrupt Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>COMP1</name>
                     <description>Comparator 1 Interrupt Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>COMP2</name>
                     <description>Comparator 2 Interrupt Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>COMP3</name>
                     <description>Comparator 3 Interrupt Status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
