cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>PGA</name>
         <description>Unknown</description>
         <baseAddress>0x40069000</baseAddress>
         <groupName>PGA</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000200</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>PGABIASCON</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>PGA Bias Circuit Control Signal</description>
               <resetValue>0x0000003F</resetValue>
               <fields>
                  <field>
                     <name>PD0BUF0P2</name>
                     <description>Buf_200mv Power Down</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Buf_200mV Enable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Buf_200mv Power Down</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PD1BUF0P2</name>
                     <description>Buf_200mv Power Down</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Buf_200mV Enable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Buf_200mv Power Down</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PD0BUF1P25</name>
                     <description>BUF1P25 Power Down</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>BUF1p25 Enable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>BUF1p25 Power Down</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PD1BUF1P25</name>
                     <description>BUF1P25 Power Down</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>BUF1p25 Enable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>BUF1p25 Power Down</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PD2BUF1P25</name>
                     <description>BUF1P25 Power Down</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>BUF1p25 Enable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>BUF1p25 Power Down</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PD3BUF1P25</name>
                     <description>BUF1P25 Power Down</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>BUF1p25 Enable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>BUF1p25 Power Down</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PGA0CON</name>
               <addressOffset>0x00000020</addressOffset>
               <size>32</size>
               <description>PGA0 Control Register</description>
               <resetValue>0x00000019</resetValue>
               <fields>
                  <field>
                     <name>PDPGACORE</name>
                     <description>PGA Core Power Down</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>PGA or TIA Mode Selection</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PGAMODE</name>
                           <description>PGA Mode Enable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAMODE</name>
                           <description>TIA Mode Enable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PGAMODE</name>
                     <description>PGA DC Mode or AC Couple Mode Selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DCCOUPLE</name>
                           <description>PGA DC Mode Enable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACCOUPLE</name>
                           <description>PGA AC Coupling Mode Enable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CAPBYPASS</name>
                     <description>Bypass the External Cap</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>BYPDISABLE</name>
                           <description>Select the External CAP</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BYPEN</name>
                           <description>Bypass the External Cap</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PGAGAIN</name>
                     <description>PGA Gain Configuration</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>GAIN1</name>
                           <description>Gain=1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GAIN2</name>
                           <description>GAIN=2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GAIN4</name>
                           <description>GAIN=4</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GAIN6</name>
                           <description>GAIN=6</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GAIN8</name>
                           <description>GAIN=8</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GAIN10</name>
                           <description>GAIN=10</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TIAGAIN</name>
                     <description>TIA Gain Configuration</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RES250</name>
                           <description>TIARES=250ohm</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RES750</name>
                           <description>TIARES=750ohm</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RES2K</name>
                           <description>TIARES=2kohm</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RES5K</name>
                           <description>TIARES=5kohm</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RES10K</name>
                           <description>TIARES=10kohm</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RES20k</name>
                           <description>TIARES=20kohm</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RES100K</name>
                           <description>TIARES=100kohm</description>
                           <value>6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TIAVDACSEL</name>
                     <description>TIA Vbias Selection of VDAC Channel</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>VDAC8SEL</name>
                           <description>Select VDAC8 as TIA Vbias</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VDAC9SEL</name>
                           <description>Select VDAC9 as TIA Vbias</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VDAC10SEL</name>
                           <description>Select VDAC10 as TIA Vbias</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VDAC11SEL</name>
                           <description>Select VDAC11 as TIA Vbias</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DRVEN</name>
                     <description>Sink Current Ability Improve</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DRVDISABLE</name>
                           <description>Disable Isink Ability Improvement, Normal Drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DRVENABLE</name>
                           <description>Enable Isink Ability Improvement</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TIASRCEN</name>
                     <description>Select Between Source Mode and Sink Mode</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SINKMD</name>
                           <description>Sink Mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SOURCEMD</name>
                           <description>Source Mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PGA0CHPCON</name>
               <addressOffset>0x00000024</addressOffset>
               <size>32</size>
               <description>PGA0 Chop Function Ctrl</description>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>CHOPOFF</name>
                     <description>Disable Chop Function</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CHOPEN</name>
                           <description>Enable Chop Function</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHOPDIS</name>
                           <description>Disable Chop Function</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PGA3CHPCON</name>
               <addressOffset>0x00000028</addressOffset>
               <size>32</size>
               <description>PGA3 Chop Function Ctrl</description>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>CHOPOFF</name>
                     <description>Disable Chop Function</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CHOPEN</name>
                           <description>Enable Chop Function</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHOPDIS</name>
                           <description>Disable Chop Function</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
