cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>PLL</name>
         <description>Unknown</description>
         <baseAddress>0x40069200</baseAddress>
         <groupName>PLL</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000200</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>PLL</name>
	    <value>64</value>
	    <description>PLL</description>
	 </interrupt>
         <registers>
            <register>
               <name>PLLPDCTRL</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>Unknown</description>
               <resetValue>0x0000003F</resetValue>
               <fields>
                  <field>
                     <name>TOTPDB</name>
                     <description>PDB of PLL All</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>TMPSNS</name>
         <description>Unknown</description>
         <baseAddress>0x40069600</baseAddress>
         <groupName>TMPSNS</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000200</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>TMPSNSCON</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>Unknown</description>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>ENTMPSNS</name>
                     <description>Enable Temp Sensor</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>TMPSNSCHPCON</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <description>Unknown</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHOFFTMPSNS</name>
                     <description>Chopping Disable = 1 Enable = 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>VCMREFCON</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <description>Unknown</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PGAREFSEL</name>
                     <description>0.2V or 0.5V Selection for PGA</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SEL0P2V</name>
                           <description>Select 0.2V Reference</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEL0P5V</name>
                           <description>Select 0.5V Reference</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>VCMBUFCON</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size>
               <description>Unknown</description>
               <resetValue>0x00000013</resetValue>
               <fields>
                  <field>
                     <name>PDBUF0</name>
                     <description>Power Down Unit Gain Buffer0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PDBUF1</name>
                     <description>Power Down Unit Gain Buffer1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MUXSEL0</name>
                     <description>Selection 0=2.5V 1=1.25V</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>BUF0_2P5</name>
                           <description>Input Buffer0 2.5V</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BUF0_1P25</name>
                           <description>Input Buffer0 1.25V</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MUXSEL1</name>
                     <description>Selection 0=2.5V 1=1.25V</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>BUF1_2P5</name>
                           <description>Buffer1 Input 2.5V</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BUF1_1P25</name>
                           <description>Buffer1 Input 1.25V</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
