cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM410.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>VDAC</name>
         <description>Unknown</description>
         <baseAddress>0x40069800</baseAddress>
         <groupName>VDAC</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000200</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>VDAC</name>
	    <value>72</value>
	    <description>VDAC</description>
	 </interrupt>
         <registers>
            <register>
               <dim>12</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11</dimIndex>
               <name>DACCON[%s]</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>DAC Control Register</description>
               <resetValue>0x00000D02</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>DAC Input Data Clear, Won&#39;t Be Controlled by Sync Mode.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CLEAR</name>
                           <description>DAC DATA Clear</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAROFF</name>
                           <description>DAC DATA Normal Input</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FSLVL</name>
                     <description>Select Output Full Scale</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>OUT2P5</name>
                           <description>Full Scale is 2.5V</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OUT3V3</name>
                           <description>Full Scale is 3.3V</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PD</name>
                     <description>DAC Top Power Down</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DACON</name>
                           <description>DAC Top Enable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DACOFF</name>
                           <description>DAC TOP Power Down</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DRV</name>
                     <description>Drive Ability Boost Enable, Can Drive 10mA Load.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Normal Work Mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DRIVEBOOST</name>
                           <description>Drive Ability Boost Mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>12</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11</dimIndex>
               <name>DACDAT[%s]</name>
               <addressOffset>0x00000030</addressOffset>
               <size>32</size>
               <description>DAC Data Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATAIN</name>
                     <description>DAC Input Data</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
   </peripherals>
</device>

